FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* ---------------------------------  MATH_EVIER  --------------------------------- */
#define MATH_EVIER_DIVEOCIEN_Pos              0                                                       /*!< MATH EVIER: DIVEOCIEN Position          */
#define MATH_EVIER_DIVEOCIEN_Msk              (0x01UL << MATH_EVIER_DIVEOCIEN_Pos)                    /*!< MATH EVIER: DIVEOCIEN Mask              */
#define MATH_EVIER_DIVERRIEN_Pos              1                                                       /*!< MATH EVIER: DIVERRIEN Position          */
#define MATH_EVIER_DIVERRIEN_Msk              (0x01UL << MATH_EVIER_DIVERRIEN_Pos)                    /*!< MATH EVIER: DIVERRIEN Mask              */
#define MATH_EVIER_CDEOCIEN_Pos               2                                                       /*!< MATH EVIER: CDEOCIEN Position           */
#define MATH_EVIER_CDEOCIEN_Msk               (0x01UL << MATH_EVIER_CDEOCIEN_Pos)                     /*!< MATH EVIER: CDEOCIEN Mask               */
#define MATH_EVIER_CDERRIEN_Pos               3                                                       /*!< MATH EVIER: CDERRIEN Position           */
#define MATH_EVIER_CDERRIEN_Msk               (0x01UL << MATH_EVIER_CDERRIEN_Pos)                     /*!< MATH EVIER: CDERRIEN Mask               */

/* ----------------------------------  MATH_EVFR  --------------------------------- */
#define MATH_EVFR_DIVEOC_Pos                  0                                                       /*!< MATH EVFR: DIVEOC Position              */
#define MATH_EVFR_DIVEOC_Msk                  (0x01UL << MATH_EVFR_DIVEOC_Pos)                        /*!< MATH EVFR: DIVEOC Mask                  */
#define MATH_EVFR_DIVERR_Pos                  1                                                       /*!< MATH EVFR: DIVERR Position              */
#define MATH_EVFR_DIVERR_Msk                  (0x01UL << MATH_EVFR_DIVERR_Pos)                        /*!< MATH EVFR: DIVERR Mask                  */
#define MATH_EVFR_CDEOC_Pos                   2                                                       /*!< MATH EVFR: CDEOC Position               */
#define MATH_EVFR_CDEOC_Msk                   (0x01UL << MATH_EVFR_CDEOC_Pos)                         /*!< MATH EVFR: CDEOC Mask                   */
#define MATH_EVFR_CDERR_Pos                   3                                                       /*!< MATH EVFR: CDERR Position               */
#define MATH_EVFR_CDERR_Msk                   (0x01UL << MATH_EVFR_CDERR_Pos)                         /*!< MATH EVFR: CDERR Mask                   */

/* ---------------------------------  MATH_EVFSR  --------------------------------- */
#define MATH_EVFSR_DIVEOCS_Pos                0                                                       /*!< MATH EVFSR: DIVEOCS Position            */
#define MATH_EVFSR_DIVEOCS_Msk                (0x01UL << MATH_EVFSR_DIVEOCS_Pos)                      /*!< MATH EVFSR: DIVEOCS Mask                */
#define MATH_EVFSR_DIVERRS_Pos                1                                                       /*!< MATH EVFSR: DIVERRS Position            */
#define MATH_EVFSR_DIVERRS_Msk                (0x01UL << MATH_EVFSR_DIVERRS_Pos)                      /*!< MATH EVFSR: DIVERRS Mask                */
#define MATH_EVFSR_CDEOCS_Pos                 2                                                       /*!< MATH EVFSR: CDEOCS Position             */
#define MATH_EVFSR_CDEOCS_Msk                 (0x01UL << MATH_EVFSR_CDEOCS_Pos)                       /*!< MATH EVFSR: CDEOCS Mask                 */
#define MATH_EVFSR_CDERRS_Pos                 3                                                       /*!< MATH EVFSR: CDERRS Position             */
#define MATH_EVFSR_CDERRS_Msk                 (0x01UL << MATH_EVFSR_CDERRS_Pos)                       /*!< MATH EVFSR: CDERRS Mask                 */

/* ---------------------------------  MATH_EVFCR  --------------------------------- */
#define MATH_EVFCR_DIVEOCC_Pos                0                                                       /*!< MATH EVFCR: DIVEOCC Position            */
#define MATH_EVFCR_DIVEOCC_Msk                (0x01UL << MATH_EVFCR_DIVEOCC_Pos)                      /*!< MATH EVFCR: DIVEOCC Mask                */
#define MATH_EVFCR_DIVERRC_Pos                1                                                       /*!< MATH EVFCR: DIVERRC Position            */
#define MATH_EVFCR_DIVERRC_Msk                (0x01UL << MATH_EVFCR_DIVERRC_Pos)                      /*!< MATH EVFCR: DIVERRC Mask                */
#define MATH_EVFCR_CDEOCC_Pos                 2                                                       /*!< MATH EVFCR: CDEOCC Position             */
#define MATH_EVFCR_CDEOCC_Msk                 (0x01UL << MATH_EVFCR_CDEOCC_Pos)                       /*!< MATH EVFCR: CDEOCC Mask                 */
#define MATH_EVFCR_CDERRC_Pos                 3                                                       /*!< MATH EVFCR: CDERRC Position             */
#define MATH_EVFCR_CDERRC_Msk                 (0x01UL << MATH_EVFCR_CDERRC_Pos)                       /*!< MATH EVFCR: CDERRC Mask                 */

/* ----------------------------------  MATH_DVD  ---------------------------------- */
#define MATH_DVD_VAL_Pos                      0                                                       /*!< MATH DVD: VAL Position                  */
#define MATH_DVD_VAL_Msk                      (0xffffffffUL << MATH_DVD_VAL_Pos)                      /*!< MATH DVD: VAL Mask                      */

/* ----------------------------------  MATH_DVS  ---------------------------------- */
#define MATH_DVS_VAL_Pos                      0                                                       /*!< MATH DVS: VAL Position                  */
#define MATH_DVS_VAL_Msk                      (0xffffffffUL << MATH_DVS_VAL_Pos)                      /*!< MATH DVS: VAL Mask                      */

/* ----------------------------------  MATH_QUOT  --------------------------------- */
#define MATH_QUOT_VAL_Pos                     0                                                       /*!< MATH QUOT: VAL Position                 */
#define MATH_QUOT_VAL_Msk                     (0xffffffffUL << MATH_QUOT_VAL_Pos)                     /*!< MATH QUOT: VAL Mask                     */

/* ----------------------------------  MATH_RMD  ---------------------------------- */
#define MATH_RMD_VAL_Pos                      0                                                       /*!< MATH RMD: VAL Position                  */
#define MATH_RMD_VAL_Msk                      (0xffffffffUL << MATH_RMD_VAL_Pos)                      /*!< MATH RMD: VAL Mask                      */

/* ---------------------------------  MATH_DIVST  --------------------------------- */
#define MATH_DIVST_BSY_Pos                    0                                                       /*!< MATH DIVST: BSY Position                */
#define MATH_DIVST_BSY_Msk                    (0x01UL << MATH_DIVST_BSY_Pos)                          /*!< MATH DIVST: BSY Mask                    */

/* ---------------------------------  MATH_DIVCON  -------------------------------- */
#define MATH_DIVCON_ST_Pos                    0                                                       /*!< MATH DIVCON: ST Position                */
#define MATH_DIVCON_ST_Msk                    (0x01UL << MATH_DIVCON_ST_Pos)                          /*!< MATH DIVCON: ST Mask                    */
#define MATH_DIVCON_STMODE_Pos                1                                                       /*!< MATH DIVCON: STMODE Position            */
#define MATH_DIVCON_STMODE_Msk                (0x01UL << MATH_DIVCON_STMODE_Pos)                      /*!< MATH DIVCON: STMODE Mask                */
#define MATH_DIVCON_USIGN_Pos                 2                                                       /*!< MATH DIVCON: USIGN Position             */
#define MATH_DIVCON_USIGN_Msk                 (0x01UL << MATH_DIVCON_USIGN_Pos)                       /*!< MATH DIVCON: USIGN Mask                 */
#define MATH_DIVCON_DIVMODE_Pos               3                                                       /*!< MATH DIVCON: DIVMODE Position           */
#define MATH_DIVCON_DIVMODE_Msk               (0x03UL << MATH_DIVCON_DIVMODE_Pos)                     /*!< MATH DIVCON: DIVMODE Mask               */
#define MATH_DIVCON_QSCNT_Pos                 8                                                       /*!< MATH DIVCON: QSCNT Position             */
#define MATH_DIVCON_QSCNT_Msk                 (0x1fUL << MATH_DIVCON_QSCNT_Pos)                       /*!< MATH DIVCON: QSCNT Mask                 */
#define MATH_DIVCON_QSDIR_Pos                 15                                                      /*!< MATH DIVCON: QSDIR Position             */
#define MATH_DIVCON_QSDIR_Msk                 (0x01UL << MATH_DIVCON_QSDIR_Pos)                       /*!< MATH DIVCON: QSDIR Mask                 */
#define MATH_DIVCON_DVDSLC_Pos                16                                                      /*!< MATH DIVCON: DVDSLC Position            */
#define MATH_DIVCON_DVDSLC_Msk                (0x1fUL << MATH_DIVCON_DVDSLC_Pos)                      /*!< MATH DIVCON: DVDSLC Mask                */
#define MATH_DIVCON_DVSSRC_Pos                24                                                      /*!< MATH DIVCON: DVSSRC Position            */
#define MATH_DIVCON_DVSSRC_Msk                (0x1fUL << MATH_DIVCON_DVSSRC_Pos)                      /*!< MATH DIVCON: DVSSRC Mask                */

/* ---------------------------------  MATH_STATC  --------------------------------- */
#define MATH_STATC_BSY_Pos                    0                                                       /*!< MATH STATC: BSY Position                */
#define MATH_STATC_BSY_Msk                    (0x01UL << MATH_STATC_BSY_Pos)                          /*!< MATH STATC: BSY Mask                    */
#define MATH_STATC_KEEPX_Pos                  5                                                       /*!< MATH STATC: KEEPX Position              */
#define MATH_STATC_KEEPX_Msk                  (0x01UL << MATH_STATC_KEEPX_Pos)                        /*!< MATH STATC: KEEPX Mask                  */
#define MATH_STATC_KEEPY_Pos                  6                                                       /*!< MATH STATC: KEEPY Position              */
#define MATH_STATC_KEEPY_Msk                  (0x01UL << MATH_STATC_KEEPY_Pos)                        /*!< MATH STATC: KEEPY Mask                  */
#define MATH_STATC_KEEPZ_Pos                  7                                                       /*!< MATH STATC: KEEPZ Position              */
#define MATH_STATC_KEEPZ_Msk                  (0x01UL << MATH_STATC_KEEPZ_Pos)                        /*!< MATH STATC: KEEPZ Mask                  */

/* ----------------------------------  MATH_CON  ---------------------------------- */
#define MATH_CON_ST_Pos                       0                                                       /*!< MATH CON: ST Position                   */
#define MATH_CON_ST_Msk                       (0x01UL << MATH_CON_ST_Pos)                             /*!< MATH CON: ST Mask                       */
#define MATH_CON_MODE_Pos                     1                                                       /*!< MATH CON: MODE Position                 */
#define MATH_CON_MODE_Msk                     (0x03UL << MATH_CON_MODE_Pos)                           /*!< MATH CON: MODE Mask                     */
#define MATH_CON_ROTVEC_Pos                   3                                                       /*!< MATH CON: ROTVEC Position               */
#define MATH_CON_ROTVEC_Msk                   (0x01UL << MATH_CON_ROTVEC_Pos)                         /*!< MATH CON: ROTVEC Mask                   */
#define MATH_CON_ST_MODE_Pos                  4                                                       /*!< MATH CON: ST_MODE Position              */
#define MATH_CON_ST_MODE_Msk                  (0x01UL << MATH_CON_ST_MODE_Pos)                        /*!< MATH CON: ST_MODE Mask                  */
#define MATH_CON_X_USIGN_Pos                  5                                                       /*!< MATH CON: X_USIGN Position              */
#define MATH_CON_X_USIGN_Msk                  (0x01UL << MATH_CON_X_USIGN_Pos)                        /*!< MATH CON: X_USIGN Mask                  */
#define MATH_CON_MPS_Pos                      6                                                       /*!< MATH CON: MPS Position                  */
#define MATH_CON_MPS_Msk                      (0x03UL << MATH_CON_MPS_Pos)                            /*!< MATH CON: MPS Mask                      */

