FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* ---------------------------------  MATH_CORDX  --------------------------------- */
#define MATH_CORDX_DATA_Pos                   8                                                       /*!< MATH CORDX: DATA Position               */
#define MATH_CORDX_DATA_Msk                   (0x00ffffffUL << MATH_CORDX_DATA_Pos)                   /*!< MATH CORDX: DATA Mask                   */

/* ---------------------------------  MATH_CORDY  --------------------------------- */
#define MATH_CORDY_DATA_Pos                   8                                                       /*!< MATH CORDY: DATA Position               */
#define MATH_CORDY_DATA_Msk                   (0x00ffffffUL << MATH_CORDY_DATA_Pos)                   /*!< MATH CORDY: DATA Mask                   */

/* ---------------------------------  MATH_CORDZ  --------------------------------- */
#define MATH_CORDZ_DATA_Pos                   8                                                       /*!< MATH CORDZ: DATA Position               */
#define MATH_CORDZ_DATA_Msk                   (0x00ffffffUL << MATH_CORDZ_DATA_Pos)                   /*!< MATH CORDZ: DATA Mask                   */

/* ---------------------------------  MATH_CORRX  --------------------------------- */
#define MATH_CORRX_RESULT_Pos                 8                                                       /*!< MATH CORRX: RESULT Position             */
#define MATH_CORRX_RESULT_Msk                 (0x00ffffffUL << MATH_CORRX_RESULT_Pos)                 /*!< MATH CORRX: RESULT Mask                 */

/* ---------------------------------  MATH_CORRY  --------------------------------- */
#define MATH_CORRY_RESULT_Pos                 8                                                       /*!< MATH CORRY: RESULT Position             */
#define MATH_CORRY_RESULT_Msk                 (0x00ffffffUL << MATH_CORRY_RESULT_Pos)                 /*!< MATH CORRY: RESULT Mask                 */

/* ---------------------------------  MATH_CORRZ  --------------------------------- */
#define MATH_CORRZ_RESULT_Pos                 8                                                       /*!< MATH CORRZ: RESULT Position             */
#define MATH_CORRZ_RESULT_Msk                 (0x00ffffffUL << MATH_CORRZ_RESULT_Pos)                 /*!< MATH CORRZ: RESULT Mask                 */


/* ================================================================================ */
/* ================          struct 'PAU' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  PAU_AVAIL0  --------------------------------- */
#define PAU_AVAIL0_AVAIL20_Pos                20                                                      /*!< PAU AVAIL0: AVAIL20 Position            */
#define PAU_AVAIL0_AVAIL20_Msk                (0x01UL << PAU_AVAIL0_AVAIL20_Pos)                      /*!< PAU AVAIL0: AVAIL20 Mask                */
#define PAU_AVAIL0_AVAIL21_Pos                21                                                      /*!< PAU AVAIL0: AVAIL21 Position            */
#define PAU_AVAIL0_AVAIL21_Msk                (0x01UL << PAU_AVAIL0_AVAIL21_Pos)                      /*!< PAU AVAIL0: AVAIL21 Mask                */
#define PAU_AVAIL0_AVAIL22_Pos                22                                                      /*!< PAU AVAIL0: AVAIL22 Position            */
#define PAU_AVAIL0_AVAIL22_Msk                (0x01UL << PAU_AVAIL0_AVAIL22_Pos)                      /*!< PAU AVAIL0: AVAIL22 Mask                */
#define PAU_AVAIL0_AVAIL23_Pos                23                                                      /*!< PAU AVAIL0: AVAIL23 Position            */
#define PAU_AVAIL0_AVAIL23_Msk                (0x01UL << PAU_AVAIL0_AVAIL23_Pos)                      /*!< PAU AVAIL0: AVAIL23 Mask                */
#define PAU_AVAIL0_AVAIL24_Pos                24                                                      /*!< PAU AVAIL0: AVAIL24 Position            */
#define PAU_AVAIL0_AVAIL24_Msk                (0x01UL << PAU_AVAIL0_AVAIL24_Pos)                      /*!< PAU AVAIL0: AVAIL24 Mask                */

/* ---------------------------------  PAU_AVAIL1  --------------------------------- */
#define PAU_AVAIL1_AVAIL0_Pos                 0                                                       /*!< PAU AVAIL1: AVAIL0 Position             */
#define PAU_AVAIL1_AVAIL0_Msk                 (0x01UL << PAU_AVAIL1_AVAIL0_Pos)                       /*!< PAU AVAIL1: AVAIL0 Mask                 */
#define PAU_AVAIL1_AVAIL1_Pos                 1                                                       /*!< PAU AVAIL1: AVAIL1 Position             */
#define PAU_AVAIL1_AVAIL1_Msk                 (0x01UL << PAU_AVAIL1_AVAIL1_Pos)                       /*!< PAU AVAIL1: AVAIL1 Mask                 */
#define PAU_AVAIL1_AVAIL4_Pos                 4                                                       /*!< PAU AVAIL1: AVAIL4 Position             */
#define PAU_AVAIL1_AVAIL4_Msk                 (0x01UL << PAU_AVAIL1_AVAIL4_Pos)                       /*!< PAU AVAIL1: AVAIL4 Mask                 */
#define PAU_AVAIL1_AVAIL5_Pos                 5                                                       /*!< PAU AVAIL1: AVAIL5 Position             */
#define PAU_AVAIL1_AVAIL5_Msk                 (0x01UL << PAU_AVAIL1_AVAIL5_Pos)                       /*!< PAU AVAIL1: AVAIL5 Mask                 */
#define PAU_AVAIL1_AVAIL6_Pos                 6                                                       /*!< PAU AVAIL1: AVAIL6 Position             */
#define PAU_AVAIL1_AVAIL6_Msk                 (0x01UL << PAU_AVAIL1_AVAIL6_Pos)                       /*!< PAU AVAIL1: AVAIL6 Mask                 */
#define PAU_AVAIL1_AVAIL7_Pos                 7                                                       /*!< PAU AVAIL1: AVAIL7 Position             */
#define PAU_AVAIL1_AVAIL7_Msk                 (0x01UL << PAU_AVAIL1_AVAIL7_Pos)                       /*!< PAU AVAIL1: AVAIL7 Mask                 */
#define PAU_AVAIL1_AVAIL8_Pos                 8                                                       /*!< PAU AVAIL1: AVAIL8 Position             */
#define PAU_AVAIL1_AVAIL8_Msk                 (0x01UL << PAU_AVAIL1_AVAIL8_Pos)                       /*!< PAU AVAIL1: AVAIL8 Mask                 */
#define PAU_AVAIL1_AVAIL9_Pos                 9                                                       /*!< PAU AVAIL1: AVAIL9 Position             */
#define PAU_AVAIL1_AVAIL9_Msk                 (0x01UL << PAU_AVAIL1_AVAIL9_Pos)                       /*!< PAU AVAIL1: AVAIL9 Mask                 */
#define PAU_AVAIL1_AVAIL10_Pos                10                                                      /*!< PAU AVAIL1: AVAIL10 Position            */
#define PAU_AVAIL1_AVAIL10_Msk                (0x01UL << PAU_AVAIL1_AVAIL10_Pos)                      /*!< PAU AVAIL1: AVAIL10 Mask                */
#define PAU_AVAIL1_AVAIL11_Pos                11                                                      /*!< PAU AVAIL1: AVAIL11 Position            */
#define PAU_AVAIL1_AVAIL11_Msk                (0x01UL << PAU_AVAIL1_AVAIL11_Pos)                      /*!< PAU AVAIL1: AVAIL11 Mask                */
#define PAU_AVAIL1_AVAIL12_Pos                12                                                      /*!< PAU AVAIL1: AVAIL12 Position            */
#define PAU_AVAIL1_AVAIL12_Msk                (0x01UL << PAU_AVAIL1_AVAIL12_Pos)                      /*!< PAU AVAIL1: AVAIL12 Mask                */

/* ---------------------------------  PAU_AVAIL2  --------------------------------- */
#define PAU_AVAIL2_AVAIL0_Pos                 0                                                       /*!< PAU AVAIL2: AVAIL0 Position             */
#define PAU_AVAIL2_AVAIL0_Msk                 (0x01UL << PAU_AVAIL2_AVAIL0_Pos)                       /*!< PAU AVAIL2: AVAIL0 Mask                 */
#define PAU_AVAIL2_AVAIL1_Pos                 1                                                       /*!< PAU AVAIL2: AVAIL1 Position             */
#define PAU_AVAIL2_AVAIL1_Msk                 (0x01UL << PAU_AVAIL2_AVAIL1_Pos)                       /*!< PAU AVAIL2: AVAIL1 Mask                 */
#define PAU_AVAIL2_AVAIL2_Pos                 2                                                       /*!< PAU AVAIL2: AVAIL2 Position             */
#define PAU_AVAIL2_AVAIL2_Msk                 (0x01UL << PAU_AVAIL2_AVAIL2_Pos)                       /*!< PAU AVAIL2: AVAIL2 Mask                 */
#define PAU_AVAIL2_AVAIL3_Pos                 3                                                       /*!< PAU AVAIL2: AVAIL3 Position             */
#define PAU_AVAIL2_AVAIL3_Msk                 (0x01UL << PAU_AVAIL2_AVAIL3_Pos)                       /*!< PAU AVAIL2: AVAIL3 Mask                 */
#define PAU_AVAIL2_AVAIL12_Pos                12                                                      /*!< PAU AVAIL2: AVAIL12 Position            */
#define PAU_AVAIL2_AVAIL12_Msk                (0x01UL << PAU_AVAIL2_AVAIL12_Pos)                      /*!< PAU AVAIL2: AVAIL12 Mask                */
#define PAU_AVAIL2_AVAIL15_Pos                15                                                      /*!< PAU AVAIL2: AVAIL15 Position            */
#define PAU_AVAIL2_AVAIL15_Msk                (0x01UL << PAU_AVAIL2_AVAIL15_Pos)                      /*!< PAU AVAIL2: AVAIL15 Mask                */

