FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* --------------------------------  PAU_PRIVDIS0  -------------------------------- */
#define PAU_PRIVDIS0_PDIS2_Pos                2                                                       /*!< PAU PRIVDIS0: PDIS2 Position            */
#define PAU_PRIVDIS0_PDIS2_Msk                (0x01UL << PAU_PRIVDIS0_PDIS2_Pos)                      /*!< PAU PRIVDIS0: PDIS2 Mask                */
#define PAU_PRIVDIS0_PDIS5_Pos                5                                                       /*!< PAU PRIVDIS0: PDIS5 Position            */
#define PAU_PRIVDIS0_PDIS5_Msk                (0x01UL << PAU_PRIVDIS0_PDIS5_Pos)                      /*!< PAU PRIVDIS0: PDIS5 Mask                */
#define PAU_PRIVDIS0_PDIS6_Pos                6                                                       /*!< PAU PRIVDIS0: PDIS6 Position            */
#define PAU_PRIVDIS0_PDIS6_Msk                (0x01UL << PAU_PRIVDIS0_PDIS6_Pos)                      /*!< PAU PRIVDIS0: PDIS6 Mask                */
#define PAU_PRIVDIS0_PDIS7_Pos                7                                                       /*!< PAU PRIVDIS0: PDIS7 Position            */
#define PAU_PRIVDIS0_PDIS7_Msk                (0x01UL << PAU_PRIVDIS0_PDIS7_Pos)                      /*!< PAU PRIVDIS0: PDIS7 Mask                */
#define PAU_PRIVDIS0_PDIS19_Pos               19                                                      /*!< PAU PRIVDIS0: PDIS19 Position           */
#define PAU_PRIVDIS0_PDIS19_Msk               (0x01UL << PAU_PRIVDIS0_PDIS19_Pos)                     /*!< PAU PRIVDIS0: PDIS19 Mask               */
#define PAU_PRIVDIS0_PDIS20_Pos               20                                                      /*!< PAU PRIVDIS0: PDIS20 Position           */
#define PAU_PRIVDIS0_PDIS20_Msk               (0x01UL << PAU_PRIVDIS0_PDIS20_Pos)                     /*!< PAU PRIVDIS0: PDIS20 Mask               */
#define PAU_PRIVDIS0_PDIS21_Pos               21                                                      /*!< PAU PRIVDIS0: PDIS21 Position           */
#define PAU_PRIVDIS0_PDIS21_Msk               (0x01UL << PAU_PRIVDIS0_PDIS21_Pos)                     /*!< PAU PRIVDIS0: PDIS21 Mask               */
#define PAU_PRIVDIS0_PDIS22_Pos               22                                                      /*!< PAU PRIVDIS0: PDIS22 Position           */
#define PAU_PRIVDIS0_PDIS22_Msk               (0x01UL << PAU_PRIVDIS0_PDIS22_Pos)                     /*!< PAU PRIVDIS0: PDIS22 Mask               */
#define PAU_PRIVDIS0_PDIS23_Pos               23                                                      /*!< PAU PRIVDIS0: PDIS23 Position           */
#define PAU_PRIVDIS0_PDIS23_Msk               (0x01UL << PAU_PRIVDIS0_PDIS23_Pos)                     /*!< PAU PRIVDIS0: PDIS23 Mask               */
#define PAU_PRIVDIS0_PDIS24_Pos               24                                                      /*!< PAU PRIVDIS0: PDIS24 Position           */
#define PAU_PRIVDIS0_PDIS24_Msk               (0x01UL << PAU_PRIVDIS0_PDIS24_Pos)                     /*!< PAU PRIVDIS0: PDIS24 Mask               */

/* --------------------------------  PAU_PRIVDIS1  -------------------------------- */
#define PAU_PRIVDIS1_PDIS0_Pos                0                                                       /*!< PAU PRIVDIS1: PDIS0 Position            */
#define PAU_PRIVDIS1_PDIS0_Msk                (0x01UL << PAU_PRIVDIS1_PDIS0_Pos)                      /*!< PAU PRIVDIS1: PDIS0 Mask                */
#define PAU_PRIVDIS1_PDIS1_Pos                1                                                       /*!< PAU PRIVDIS1: PDIS1 Position            */
#define PAU_PRIVDIS1_PDIS1_Msk                (0x01UL << PAU_PRIVDIS1_PDIS1_Pos)                      /*!< PAU PRIVDIS1: PDIS1 Mask                */
#define PAU_PRIVDIS1_PDIS5_Pos                5                                                       /*!< PAU PRIVDIS1: PDIS5 Position            */
#define PAU_PRIVDIS1_PDIS5_Msk                (0x01UL << PAU_PRIVDIS1_PDIS5_Pos)                      /*!< PAU PRIVDIS1: PDIS5 Mask                */
#define PAU_PRIVDIS1_PDIS6_Pos                6                                                       /*!< PAU PRIVDIS1: PDIS6 Position            */
#define PAU_PRIVDIS1_PDIS6_Msk                (0x01UL << PAU_PRIVDIS1_PDIS6_Pos)                      /*!< PAU PRIVDIS1: PDIS6 Mask                */
#define PAU_PRIVDIS1_PDIS7_Pos                7                                                       /*!< PAU PRIVDIS1: PDIS7 Position            */
#define PAU_PRIVDIS1_PDIS7_Msk                (0x01UL << PAU_PRIVDIS1_PDIS7_Pos)                      /*!< PAU PRIVDIS1: PDIS7 Mask                */
#define PAU_PRIVDIS1_PDIS8_Pos                8                                                       /*!< PAU PRIVDIS1: PDIS8 Position            */
#define PAU_PRIVDIS1_PDIS8_Msk                (0x01UL << PAU_PRIVDIS1_PDIS8_Pos)                      /*!< PAU PRIVDIS1: PDIS8 Mask                */
#define PAU_PRIVDIS1_PDIS9_Pos                9                                                       /*!< PAU PRIVDIS1: PDIS9 Position            */
#define PAU_PRIVDIS1_PDIS9_Msk                (0x01UL << PAU_PRIVDIS1_PDIS9_Pos)                      /*!< PAU PRIVDIS1: PDIS9 Mask                */
#define PAU_PRIVDIS1_PDIS10_Pos               10                                                      /*!< PAU PRIVDIS1: PDIS10 Position           */
#define PAU_PRIVDIS1_PDIS10_Msk               (0x01UL << PAU_PRIVDIS1_PDIS10_Pos)                     /*!< PAU PRIVDIS1: PDIS10 Mask               */
#define PAU_PRIVDIS1_PDIS11_Pos               11                                                      /*!< PAU PRIVDIS1: PDIS11 Position           */
#define PAU_PRIVDIS1_PDIS11_Msk               (0x01UL << PAU_PRIVDIS1_PDIS11_Pos)                     /*!< PAU PRIVDIS1: PDIS11 Mask               */
#define PAU_PRIVDIS1_PDIS12_Pos               12                                                      /*!< PAU PRIVDIS1: PDIS12 Position           */
#define PAU_PRIVDIS1_PDIS12_Msk               (0x01UL << PAU_PRIVDIS1_PDIS12_Pos)                     /*!< PAU PRIVDIS1: PDIS12 Mask               */

/* --------------------------------  PAU_PRIVDIS2  -------------------------------- */
#define PAU_PRIVDIS2_PDIS0_Pos                0                                                       /*!< PAU PRIVDIS2: PDIS0 Position            */
#define PAU_PRIVDIS2_PDIS0_Msk                (0x01UL << PAU_PRIVDIS2_PDIS0_Pos)                      /*!< PAU PRIVDIS2: PDIS0 Mask                */
#define PAU_PRIVDIS2_PDIS1_Pos                1                                                       /*!< PAU PRIVDIS2: PDIS1 Position            */
#define PAU_PRIVDIS2_PDIS1_Msk                (0x01UL << PAU_PRIVDIS2_PDIS1_Pos)                      /*!< PAU PRIVDIS2: PDIS1 Mask                */
#define PAU_PRIVDIS2_PDIS2_Pos                2                                                       /*!< PAU PRIVDIS2: PDIS2 Position            */
#define PAU_PRIVDIS2_PDIS2_Msk                (0x01UL << PAU_PRIVDIS2_PDIS2_Pos)                      /*!< PAU PRIVDIS2: PDIS2 Mask                */
#define PAU_PRIVDIS2_PDIS3_Pos                3                                                       /*!< PAU PRIVDIS2: PDIS3 Position            */
#define PAU_PRIVDIS2_PDIS3_Msk                (0x01UL << PAU_PRIVDIS2_PDIS3_Pos)                      /*!< PAU PRIVDIS2: PDIS3 Mask                */
#define PAU_PRIVDIS2_PDIS12_Pos               12                                                      /*!< PAU PRIVDIS2: PDIS12 Position           */
#define PAU_PRIVDIS2_PDIS12_Msk               (0x01UL << PAU_PRIVDIS2_PDIS12_Pos)                     /*!< PAU PRIVDIS2: PDIS12 Mask               */
#define PAU_PRIVDIS2_PDIS15_Pos               15                                                      /*!< PAU PRIVDIS2: PDIS15 Position           */
#define PAU_PRIVDIS2_PDIS15_Msk               (0x01UL << PAU_PRIVDIS2_PDIS15_Pos)                     /*!< PAU PRIVDIS2: PDIS15 Mask               */

/* ---------------------------------  PAU_ROMSIZE  -------------------------------- */
#define PAU_ROMSIZE_ADDR_Pos                  8                                                       /*!< PAU ROMSIZE: ADDR Position              */
#define PAU_ROMSIZE_ADDR_Msk                  (0x3fUL << PAU_ROMSIZE_ADDR_Pos)                        /*!< PAU ROMSIZE: ADDR Mask                  */

/* ---------------------------------  PAU_FLSIZE  --------------------------------- */
#define PAU_FLSIZE_ADDR_Pos                   12                                                      /*!< PAU FLSIZE: ADDR Position               */
#define PAU_FLSIZE_ADDR_Msk                   (0x3fUL << PAU_FLSIZE_ADDR_Pos)                         /*!< PAU FLSIZE: ADDR Mask                   */

/* --------------------------------  PAU_RAM0SIZE  -------------------------------- */
#define PAU_RAM0SIZE_ADDR_Pos                 8                                                       /*!< PAU RAM0SIZE: ADDR Position             */
#define PAU_RAM0SIZE_ADDR_Msk                 (0x1fUL << PAU_RAM0SIZE_ADDR_Pos)                       /*!< PAU RAM0SIZE: ADDR Mask                 */


/* ================================================================================ */
/* ================          struct 'NVM' Position & Mask          ================ */
/* ================================================================================ */


