FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* --------------------------------  NVM_NVMSTATUS  ------------------------------- */
#define NVM_NVMSTATUS_BUSY_Pos                0                                                       /*!< NVM NVMSTATUS: BUSY Position            */
#define NVM_NVMSTATUS_BUSY_Msk                (0x01UL << NVM_NVMSTATUS_BUSY_Pos)                      /*!< NVM NVMSTATUS: BUSY Mask                */
#define NVM_NVMSTATUS_SLEEP_Pos               1                                                       /*!< NVM NVMSTATUS: SLEEP Position           */
#define NVM_NVMSTATUS_SLEEP_Msk               (0x01UL << NVM_NVMSTATUS_SLEEP_Pos)                     /*!< NVM NVMSTATUS: SLEEP Mask               */
#define NVM_NVMSTATUS_VERR_Pos                2                                                       /*!< NVM NVMSTATUS: VERR Position            */
#define NVM_NVMSTATUS_VERR_Msk                (0x03UL << NVM_NVMSTATUS_VERR_Pos)                      /*!< NVM NVMSTATUS: VERR Mask                */
#define NVM_NVMSTATUS_ECC1READ_Pos            4                                                       /*!< NVM NVMSTATUS: ECC1READ Position        */
#define NVM_NVMSTATUS_ECC1READ_Msk            (0x01UL << NVM_NVMSTATUS_ECC1READ_Pos)                  /*!< NVM NVMSTATUS: ECC1READ Mask            */
#define NVM_NVMSTATUS_ECC2READ_Pos            5                                                       /*!< NVM NVMSTATUS: ECC2READ Position        */
#define NVM_NVMSTATUS_ECC2READ_Msk            (0x01UL << NVM_NVMSTATUS_ECC2READ_Pos)                  /*!< NVM NVMSTATUS: ECC2READ Mask            */
#define NVM_NVMSTATUS_WRPERR_Pos              6                                                       /*!< NVM NVMSTATUS: WRPERR Position          */
#define NVM_NVMSTATUS_WRPERR_Msk              (0x01UL << NVM_NVMSTATUS_WRPERR_Pos)                    /*!< NVM NVMSTATUS: WRPERR Mask              */

/* ---------------------------------  NVM_NVMPROG  -------------------------------- */
#define NVM_NVMPROG_ACTION_Pos                0                                                       /*!< NVM NVMPROG: ACTION Position            */
#define NVM_NVMPROG_ACTION_Msk                (0x000000ffUL << NVM_NVMPROG_ACTION_Pos)                /*!< NVM NVMPROG: ACTION Mask                */
#define NVM_NVMPROG_RSTVERR_Pos               12                                                      /*!< NVM NVMPROG: RSTVERR Position           */
#define NVM_NVMPROG_RSTVERR_Msk               (0x01UL << NVM_NVMPROG_RSTVERR_Pos)                     /*!< NVM NVMPROG: RSTVERR Mask               */
#define NVM_NVMPROG_RSTECC_Pos                13                                                      /*!< NVM NVMPROG: RSTECC Position            */
#define NVM_NVMPROG_RSTECC_Msk                (0x01UL << NVM_NVMPROG_RSTECC_Pos)                      /*!< NVM NVMPROG: RSTECC Mask                */

/* ---------------------------------  NVM_NVMCONF  -------------------------------- */
#define NVM_NVMCONF_HRLEV_Pos                 1                                                       /*!< NVM NVMCONF: HRLEV Position             */
#define NVM_NVMCONF_HRLEV_Msk                 (0x03UL << NVM_NVMCONF_HRLEV_Pos)                       /*!< NVM NVMCONF: HRLEV Mask                 */
#define NVM_NVMCONF_SECPROT_Pos               4                                                       /*!< NVM NVMCONF: SECPROT Position           */
#define NVM_NVMCONF_SECPROT_Msk               (0x000000ffUL << NVM_NVMCONF_SECPROT_Pos)               /*!< NVM NVMCONF: SECPROT Mask               */
#define NVM_NVMCONF_INT_ON_Pos                14                                                      /*!< NVM NVMCONF: INT_ON Position            */
#define NVM_NVMCONF_INT_ON_Msk                (0x01UL << NVM_NVMCONF_INT_ON_Pos)                      /*!< NVM NVMCONF: INT_ON Mask                */
#define NVM_NVMCONF_NVM_ON_Pos                15                                                      /*!< NVM NVMCONF: NVM_ON Position            */
#define NVM_NVMCONF_NVM_ON_Msk                (0x01UL << NVM_NVMCONF_NVM_ON_Pos)                      /*!< NVM NVMCONF: NVM_ON Mask                */


/* ================================================================================ */
/* ================          struct 'WDT' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  WDT_ID  ----------------------------------- */
#define WDT_ID_MOD_REV_Pos                    0                                                       /*!< WDT ID: MOD_REV Position                */
#define WDT_ID_MOD_REV_Msk                    (0x000000ffUL << WDT_ID_MOD_REV_Pos)                    /*!< WDT ID: MOD_REV Mask                    */
#define WDT_ID_MOD_TYPE_Pos                   8                                                       /*!< WDT ID: MOD_TYPE Position               */
#define WDT_ID_MOD_TYPE_Msk                   (0x000000ffUL << WDT_ID_MOD_TYPE_Pos)                   /*!< WDT ID: MOD_TYPE Mask                   */
#define WDT_ID_MOD_NUMBER_Pos                 16                                                      /*!< WDT ID: MOD_NUMBER Position             */
#define WDT_ID_MOD_NUMBER_Msk                 (0x0000ffffUL << WDT_ID_MOD_NUMBER_Pos)                 /*!< WDT ID: MOD_NUMBER Mask                 */

/* -----------------------------------  WDT_CTR  ---------------------------------- */
#define WDT_CTR_ENB_Pos                       0                                                       /*!< WDT CTR: ENB Position                   */
#define WDT_CTR_ENB_Msk                       (0x01UL << WDT_CTR_ENB_Pos)                             /*!< WDT CTR: ENB Mask                       */
#define WDT_CTR_PRE_Pos                       1                                                       /*!< WDT CTR: PRE Position                   */
#define WDT_CTR_PRE_Msk                       (0x01UL << WDT_CTR_PRE_Pos)                             /*!< WDT CTR: PRE Mask                       */
#define WDT_CTR_DSP_Pos                       4                                                       /*!< WDT CTR: DSP Position                   */
#define WDT_CTR_DSP_Msk                       (0x01UL << WDT_CTR_DSP_Pos)                             /*!< WDT CTR: DSP Mask                       */
#define WDT_CTR_SPW_Pos                       8                                                       /*!< WDT CTR: SPW Position                   */
#define WDT_CTR_SPW_Msk                       (0x000000ffUL << WDT_CTR_SPW_Pos)                       /*!< WDT CTR: SPW Mask                       */

/* -----------------------------------  WDT_SRV  ---------------------------------- */
#define WDT_SRV_SRV_Pos                       0                                                       /*!< WDT SRV: SRV Position                   */
#define WDT_SRV_SRV_Msk                       (0xffffffffUL << WDT_SRV_SRV_Pos)                       /*!< WDT SRV: SRV Mask                       */

