FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* ----------------------------  SCU_GENERAL_DBGROMID  ---------------------------- */
#define SCU_GENERAL_DBGROMID_MANUFID_Pos      1                                                       /*!< SCU_GENERAL DBGROMID: MANUFID Position  */
#define SCU_GENERAL_DBGROMID_MANUFID_Msk      (0x000007ffUL << SCU_GENERAL_DBGROMID_MANUFID_Pos)      /*!< SCU_GENERAL DBGROMID: MANUFID Mask      */
#define SCU_GENERAL_DBGROMID_PARTNO_Pos       12                                                      /*!< SCU_GENERAL DBGROMID: PARTNO Position   */
#define SCU_GENERAL_DBGROMID_PARTNO_Msk       (0x0000ffffUL << SCU_GENERAL_DBGROMID_PARTNO_Pos)       /*!< SCU_GENERAL DBGROMID: PARTNO Mask       */
#define SCU_GENERAL_DBGROMID_VERSION_Pos      28                                                      /*!< SCU_GENERAL DBGROMID: VERSION Position  */
#define SCU_GENERAL_DBGROMID_VERSION_Msk      (0x0fUL << SCU_GENERAL_DBGROMID_VERSION_Pos)            /*!< SCU_GENERAL DBGROMID: VERSION Mask      */

/* -----------------------------  SCU_GENERAL_IDCHIP  ----------------------------- */
#define SCU_GENERAL_IDCHIP_IDCHIP_Pos         0                                                       /*!< SCU_GENERAL IDCHIP: IDCHIP Position     */
#define SCU_GENERAL_IDCHIP_IDCHIP_Msk         (0xffffffffUL << SCU_GENERAL_IDCHIP_IDCHIP_Pos)         /*!< SCU_GENERAL IDCHIP: IDCHIP Mask         */

/* -------------------------------  SCU_GENERAL_ID  ------------------------------- */
#define SCU_GENERAL_ID_MOD_REV_Pos            0                                                       /*!< SCU_GENERAL ID: MOD_REV Position        */
#define SCU_GENERAL_ID_MOD_REV_Msk            (0x000000ffUL << SCU_GENERAL_ID_MOD_REV_Pos)            /*!< SCU_GENERAL ID: MOD_REV Mask            */
#define SCU_GENERAL_ID_MOD_TYPE_Pos           8                                                       /*!< SCU_GENERAL ID: MOD_TYPE Position       */
#define SCU_GENERAL_ID_MOD_TYPE_Msk           (0x000000ffUL << SCU_GENERAL_ID_MOD_TYPE_Pos)           /*!< SCU_GENERAL ID: MOD_TYPE Mask           */
#define SCU_GENERAL_ID_MOD_NUMBER_Pos         16                                                      /*!< SCU_GENERAL ID: MOD_NUMBER Position     */
#define SCU_GENERAL_ID_MOD_NUMBER_Msk         (0x0000ffffUL << SCU_GENERAL_ID_MOD_NUMBER_Pos)         /*!< SCU_GENERAL ID: MOD_NUMBER Mask         */

/* ------------------------------  SCU_GENERAL_SSW0  ------------------------------ */
#define SCU_GENERAL_SSW0_DAT_Pos              0                                                       /*!< SCU_GENERAL SSW0: DAT Position          */
#define SCU_GENERAL_SSW0_DAT_Msk              (0xffffffffUL << SCU_GENERAL_SSW0_DAT_Pos)              /*!< SCU_GENERAL SSW0: DAT Mask              */

/* -----------------------------  SCU_GENERAL_PASSWD  ----------------------------- */
#define SCU_GENERAL_PASSWD_MODE_Pos           0                                                       /*!< SCU_GENERAL PASSWD: MODE Position       */
#define SCU_GENERAL_PASSWD_MODE_Msk           (0x03UL << SCU_GENERAL_PASSWD_MODE_Pos)                 /*!< SCU_GENERAL PASSWD: MODE Mask           */
#define SCU_GENERAL_PASSWD_PROTS_Pos          2                                                       /*!< SCU_GENERAL PASSWD: PROTS Position      */
#define SCU_GENERAL_PASSWD_PROTS_Msk          (0x01UL << SCU_GENERAL_PASSWD_PROTS_Pos)                /*!< SCU_GENERAL PASSWD: PROTS Mask          */
#define SCU_GENERAL_PASSWD_PASS_Pos           3                                                       /*!< SCU_GENERAL PASSWD: PASS Position       */
#define SCU_GENERAL_PASSWD_PASS_Msk           (0x1fUL << SCU_GENERAL_PASSWD_PASS_Pos)                 /*!< SCU_GENERAL PASSWD: PASS Mask           */

/* -----------------------------  SCU_GENERAL_CCUCON  ----------------------------- */
#define SCU_GENERAL_CCUCON_GSC40_Pos          0                                                       /*!< SCU_GENERAL CCUCON: GSC40 Position      */
#define SCU_GENERAL_CCUCON_GSC40_Msk          (0x01UL << SCU_GENERAL_CCUCON_GSC40_Pos)                /*!< SCU_GENERAL CCUCON: GSC40 Mask          */
#define SCU_GENERAL_CCUCON_GSC80_Pos          8                                                       /*!< SCU_GENERAL CCUCON: GSC80 Position      */
#define SCU_GENERAL_CCUCON_GSC80_Msk          (0x01UL << SCU_GENERAL_CCUCON_GSC80_Pos)                /*!< SCU_GENERAL CCUCON: GSC80 Mask          */

/* -----------------------------  SCU_GENERAL_MIRRSTS  ---------------------------- */
#define SCU_GENERAL_MIRRSTS_RTC_CTR_Pos       0                                                       /*!< SCU_GENERAL MIRRSTS: RTC_CTR Position   */
#define SCU_GENERAL_MIRRSTS_RTC_CTR_Msk       (0x01UL << SCU_GENERAL_MIRRSTS_RTC_CTR_Pos)             /*!< SCU_GENERAL MIRRSTS: RTC_CTR Mask       */
#define SCU_GENERAL_MIRRSTS_RTC_ATIM0_Pos     1                                                       /*!< SCU_GENERAL MIRRSTS: RTC_ATIM0 Position */
#define SCU_GENERAL_MIRRSTS_RTC_ATIM0_Msk     (0x01UL << SCU_GENERAL_MIRRSTS_RTC_ATIM0_Pos)           /*!< SCU_GENERAL MIRRSTS: RTC_ATIM0 Mask     */
#define SCU_GENERAL_MIRRSTS_RTC_ATIM1_Pos     2                                                       /*!< SCU_GENERAL MIRRSTS: RTC_ATIM1 Position */
#define SCU_GENERAL_MIRRSTS_RTC_ATIM1_Msk     (0x01UL << SCU_GENERAL_MIRRSTS_RTC_ATIM1_Pos)           /*!< SCU_GENERAL MIRRSTS: RTC_ATIM1 Mask     */
#define SCU_GENERAL_MIRRSTS_RTC_TIM0_Pos      3                                                       /*!< SCU_GENERAL MIRRSTS: RTC_TIM0 Position  */
#define SCU_GENERAL_MIRRSTS_RTC_TIM0_Msk      (0x01UL << SCU_GENERAL_MIRRSTS_RTC_TIM0_Pos)            /*!< SCU_GENERAL MIRRSTS: RTC_TIM0 Mask      */
#define SCU_GENERAL_MIRRSTS_RTC_TIM1_Pos      4                                                       /*!< SCU_GENERAL MIRRSTS: RTC_TIM1 Position  */
#define SCU_GENERAL_MIRRSTS_RTC_TIM1_Msk      (0x01UL << SCU_GENERAL_MIRRSTS_RTC_TIM1_Pos)            /*!< SCU_GENERAL MIRRSTS: RTC_TIM1 Mask      */

/* ------------------------------  SCU_GENERAL_PMTSR  ----------------------------- */
#define SCU_GENERAL_PMTSR_MTENS_Pos           0                                                       /*!< SCU_GENERAL PMTSR: MTENS Position       */
#define SCU_GENERAL_PMTSR_MTENS_Msk           (0x01UL << SCU_GENERAL_PMTSR_MTENS_Pos)                 /*!< SCU_GENERAL PMTSR: MTENS Mask           */


/* ================================================================================ */
/* ================     struct 'SCU_INTERRUPT' Position & Mask     ================ */
/* ================================================================================ */


/* -----------------------------  SCU_INTERRUPT_SRRAW  ---------------------------- */
#define SCU_INTERRUPT_SRRAW_PRWARN_Pos        0                                                       /*!< SCU_INTERRUPT SRRAW: PRWARN Position    */
#define SCU_INTERRUPT_SRRAW_PRWARN_Msk        (0x01UL << SCU_INTERRUPT_SRRAW_PRWARN_Pos)              /*!< SCU_INTERRUPT SRRAW: PRWARN Mask        */
#define SCU_INTERRUPT_SRRAW_PI_Pos            1                                                       /*!< SCU_INTERRUPT SRRAW: PI Position        */
#define SCU_INTERRUPT_SRRAW_PI_Msk            (0x01UL << SCU_INTERRUPT_SRRAW_PI_Pos)                  /*!< SCU_INTERRUPT SRRAW: PI Mask            */
#define SCU_INTERRUPT_SRRAW_AI_Pos            2                                                       /*!< SCU_INTERRUPT SRRAW: AI Position        */
#define SCU_INTERRUPT_SRRAW_AI_Msk            (0x01UL << SCU_INTERRUPT_SRRAW_AI_Pos)                  /*!< SCU_INTERRUPT SRRAW: AI Mask            */
#define SCU_INTERRUPT_SRRAW_VDDPI_Pos         3                                                       /*!< SCU_INTERRUPT SRRAW: VDDPI Position     */
#define SCU_INTERRUPT_SRRAW_VDDPI_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_VDDPI_Pos)               /*!< SCU_INTERRUPT SRRAW: VDDPI Mask         */
#define SCU_INTERRUPT_SRRAW_ACMP0I_Pos        4                                                       /*!< SCU_INTERRUPT SRRAW: ACMP0I Position    */
#define SCU_INTERRUPT_SRRAW_ACMP0I_Msk        (0x01UL << SCU_INTERRUPT_SRRAW_ACMP0I_Pos)              /*!< SCU_INTERRUPT SRRAW: ACMP0I Mask        */
#define SCU_INTERRUPT_SRRAW_ACMP1I_Pos        5                                                       /*!< SCU_INTERRUPT SRRAW: ACMP1I Position    */
#define SCU_INTERRUPT_SRRAW_ACMP1I_Msk        (0x01UL << SCU_INTERRUPT_SRRAW_ACMP1I_Pos)              /*!< SCU_INTERRUPT SRRAW: ACMP1I Mask        */
#define SCU_INTERRUPT_SRRAW_ACMP2I_Pos        6                                                       /*!< SCU_INTERRUPT SRRAW: ACMP2I Position    */
#define SCU_INTERRUPT_SRRAW_ACMP2I_Msk        (0x01UL << SCU_INTERRUPT_SRRAW_ACMP2I_Pos)              /*!< SCU_INTERRUPT SRRAW: ACMP2I Mask        */
#define SCU_INTERRUPT_SRRAW_VDROPI_Pos        7                                                       /*!< SCU_INTERRUPT SRRAW: VDROPI Position    */
#define SCU_INTERRUPT_SRRAW_VDROPI_Msk        (0x01UL << SCU_INTERRUPT_SRRAW_VDROPI_Pos)              /*!< SCU_INTERRUPT SRRAW: VDROPI Mask        */
#define SCU_INTERRUPT_SRRAW_ORC0I_Pos         8                                                       /*!< SCU_INTERRUPT SRRAW: ORC0I Position     */
#define SCU_INTERRUPT_SRRAW_ORC0I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_ORC0I_Pos)               /*!< SCU_INTERRUPT SRRAW: ORC0I Mask         */
#define SCU_INTERRUPT_SRRAW_ORC1I_Pos         9                                                       /*!< SCU_INTERRUPT SRRAW: ORC1I Position     */
#define SCU_INTERRUPT_SRRAW_ORC1I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_ORC1I_Pos)               /*!< SCU_INTERRUPT SRRAW: ORC1I Mask         */
#define SCU_INTERRUPT_SRRAW_ORC2I_Pos         10                                                      /*!< SCU_INTERRUPT SRRAW: ORC2I Position     */
#define SCU_INTERRUPT_SRRAW_ORC2I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_ORC2I_Pos)               /*!< SCU_INTERRUPT SRRAW: ORC2I Mask         */
#define SCU_INTERRUPT_SRRAW_ORC3I_Pos         11                                                      /*!< SCU_INTERRUPT SRRAW: ORC3I Position     */
#define SCU_INTERRUPT_SRRAW_ORC3I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_ORC3I_Pos)               /*!< SCU_INTERRUPT SRRAW: ORC3I Mask         */
#define SCU_INTERRUPT_SRRAW_ORC4I_Pos         12                                                      /*!< SCU_INTERRUPT SRRAW: ORC4I Position     */
#define SCU_INTERRUPT_SRRAW_ORC4I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_ORC4I_Pos)               /*!< SCU_INTERRUPT SRRAW: ORC4I Mask         */
#define SCU_INTERRUPT_SRRAW_ORC5I_Pos         13                                                      /*!< SCU_INTERRUPT SRRAW: ORC5I Position     */
#define SCU_INTERRUPT_SRRAW_ORC5I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_ORC5I_Pos)               /*!< SCU_INTERRUPT SRRAW: ORC5I Mask         */
#define SCU_INTERRUPT_SRRAW_ORC6I_Pos         14                                                      /*!< SCU_INTERRUPT SRRAW: ORC6I Position     */
#define SCU_INTERRUPT_SRRAW_ORC6I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_ORC6I_Pos)               /*!< SCU_INTERRUPT SRRAW: ORC6I Mask         */
#define SCU_INTERRUPT_SRRAW_ORC7I_Pos         15                                                      /*!< SCU_INTERRUPT SRRAW: ORC7I Position     */
#define SCU_INTERRUPT_SRRAW_ORC7I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_ORC7I_Pos)               /*!< SCU_INTERRUPT SRRAW: ORC7I Mask         */
#define SCU_INTERRUPT_SRRAW_LOCI_Pos          16                                                      /*!< SCU_INTERRUPT SRRAW: LOCI Position      */
#define SCU_INTERRUPT_SRRAW_LOCI_Msk          (0x01UL << SCU_INTERRUPT_SRRAW_LOCI_Pos)                /*!< SCU_INTERRUPT SRRAW: LOCI Mask          */
#define SCU_INTERRUPT_SRRAW_PESRAMI_Pos       17                                                      /*!< SCU_INTERRUPT SRRAW: PESRAMI Position   */
#define SCU_INTERRUPT_SRRAW_PESRAMI_Msk       (0x01UL << SCU_INTERRUPT_SRRAW_PESRAMI_Pos)             /*!< SCU_INTERRUPT SRRAW: PESRAMI Mask       */
#define SCU_INTERRUPT_SRRAW_PEU0I_Pos         18                                                      /*!< SCU_INTERRUPT SRRAW: PEU0I Position     */
#define SCU_INTERRUPT_SRRAW_PEU0I_Msk         (0x01UL << SCU_INTERRUPT_SRRAW_PEU0I_Pos)               /*!< SCU_INTERRUPT SRRAW: PEU0I Mask         */
#define SCU_INTERRUPT_SRRAW_FLECC2I_Pos       19                                                      /*!< SCU_INTERRUPT SRRAW: FLECC2I Position   */
#define SCU_INTERRUPT_SRRAW_FLECC2I_Msk       (0x01UL << SCU_INTERRUPT_SRRAW_FLECC2I_Pos)             /*!< SCU_INTERRUPT SRRAW: FLECC2I Mask       */
#define SCU_INTERRUPT_SRRAW_FLCMPLTI_Pos      20                                                      /*!< SCU_INTERRUPT SRRAW: FLCMPLTI Position  */
#define SCU_INTERRUPT_SRRAW_FLCMPLTI_Msk      (0x01UL << SCU_INTERRUPT_SRRAW_FLCMPLTI_Pos)            /*!< SCU_INTERRUPT SRRAW: FLCMPLTI Mask      */
#define SCU_INTERRUPT_SRRAW_VCLIPI_Pos        21                                                      /*!< SCU_INTERRUPT SRRAW: VCLIPI Position    */
#define SCU_INTERRUPT_SRRAW_VCLIPI_Msk        (0x01UL << SCU_INTERRUPT_SRRAW_VCLIPI_Pos)              /*!< SCU_INTERRUPT SRRAW: VCLIPI Mask        */
#define SCU_INTERRUPT_SRRAW_SBYCLKFI_Pos      22                                                      /*!< SCU_INTERRUPT SRRAW: SBYCLKFI Position  */
#define SCU_INTERRUPT_SRRAW_SBYCLKFI_Msk      (0x01UL << SCU_INTERRUPT_SRRAW_SBYCLKFI_Pos)            /*!< SCU_INTERRUPT SRRAW: SBYCLKFI Mask      */
#define SCU_INTERRUPT_SRRAW_RTC_CTR_Pos       24                                                      /*!< SCU_INTERRUPT SRRAW: RTC_CTR Position   */
#define SCU_INTERRUPT_SRRAW_RTC_CTR_Msk       (0x01UL << SCU_INTERRUPT_SRRAW_RTC_CTR_Pos)             /*!< SCU_INTERRUPT SRRAW: RTC_CTR Mask       */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM0_Pos     25                                                      /*!< SCU_INTERRUPT SRRAW: RTC_ATIM0 Position */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM0_Msk     (0x01UL << SCU_INTERRUPT_SRRAW_RTC_ATIM0_Pos)           /*!< SCU_INTERRUPT SRRAW: RTC_ATIM0 Mask     */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM1_Pos     26                                                      /*!< SCU_INTERRUPT SRRAW: RTC_ATIM1 Position */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM1_Msk     (0x01UL << SCU_INTERRUPT_SRRAW_RTC_ATIM1_Pos)           /*!< SCU_INTERRUPT SRRAW: RTC_ATIM1 Mask     */
#define SCU_INTERRUPT_SRRAW_RTC_TIM0_Pos      27                                                      /*!< SCU_INTERRUPT SRRAW: RTC_TIM0 Position  */
#define SCU_INTERRUPT_SRRAW_RTC_TIM0_Msk      (0x01UL << SCU_INTERRUPT_SRRAW_RTC_TIM0_Pos)            /*!< SCU_INTERRUPT SRRAW: RTC_TIM0 Mask      */
#define SCU_INTERRUPT_SRRAW_RTC_TIM1_Pos      28                                                      /*!< SCU_INTERRUPT SRRAW: RTC_TIM1 Position  */
#define SCU_INTERRUPT_SRRAW_RTC_TIM1_Msk      (0x01UL << SCU_INTERRUPT_SRRAW_RTC_TIM1_Pos)            /*!< SCU_INTERRUPT SRRAW: RTC_TIM1 Mask      */
#define SCU_INTERRUPT_SRRAW_TSE_DONE_Pos      29                                                      /*!< SCU_INTERRUPT SRRAW: TSE_DONE Position  */
#define SCU_INTERRUPT_SRRAW_TSE_DONE_Msk      (0x01UL << SCU_INTERRUPT_SRRAW_TSE_DONE_Pos)            /*!< SCU_INTERRUPT SRRAW: TSE_DONE Mask      */
#define SCU_INTERRUPT_SRRAW_TSE_HIGH_Pos      30                                                      /*!< SCU_INTERRUPT SRRAW: TSE_HIGH Position  */
#define SCU_INTERRUPT_SRRAW_TSE_HIGH_Msk      (0x01UL << SCU_INTERRUPT_SRRAW_TSE_HIGH_Pos)            /*!< SCU_INTERRUPT SRRAW: TSE_HIGH Mask      */
#define SCU_INTERRUPT_SRRAW_TSE_LOW_Pos       31                                                      /*!< SCU_INTERRUPT SRRAW: TSE_LOW Position   */
#define SCU_INTERRUPT_SRRAW_TSE_LOW_Msk       (0x01UL << SCU_INTERRUPT_SRRAW_TSE_LOW_Pos)             /*!< SCU_INTERRUPT SRRAW: TSE_LOW Mask       */

