FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* -----------------------------  SCU_INTERRUPT_SRSET  ---------------------------- */
#define SCU_INTERRUPT_SRSET_PRWARN_Pos        0                                                       /*!< SCU_INTERRUPT SRSET: PRWARN Position    */
#define SCU_INTERRUPT_SRSET_PRWARN_Msk        (0x01UL << SCU_INTERRUPT_SRSET_PRWARN_Pos)              /*!< SCU_INTERRUPT SRSET: PRWARN Mask        */
#define SCU_INTERRUPT_SRSET_PI_Pos            1                                                       /*!< SCU_INTERRUPT SRSET: PI Position        */
#define SCU_INTERRUPT_SRSET_PI_Msk            (0x01UL << SCU_INTERRUPT_SRSET_PI_Pos)                  /*!< SCU_INTERRUPT SRSET: PI Mask            */
#define SCU_INTERRUPT_SRSET_AI_Pos            2                                                       /*!< SCU_INTERRUPT SRSET: AI Position        */
#define SCU_INTERRUPT_SRSET_AI_Msk            (0x01UL << SCU_INTERRUPT_SRSET_AI_Pos)                  /*!< SCU_INTERRUPT SRSET: AI Mask            */
#define SCU_INTERRUPT_SRSET_VDDPI_Pos         3                                                       /*!< SCU_INTERRUPT SRSET: VDDPI Position     */
#define SCU_INTERRUPT_SRSET_VDDPI_Msk         (0x01UL << SCU_INTERRUPT_SRSET_VDDPI_Pos)               /*!< SCU_INTERRUPT SRSET: VDDPI Mask         */
#define SCU_INTERRUPT_SRSET_ACMP0I_Pos        4                                                       /*!< SCU_INTERRUPT SRSET: ACMP0I Position    */
#define SCU_INTERRUPT_SRSET_ACMP0I_Msk        (0x01UL << SCU_INTERRUPT_SRSET_ACMP0I_Pos)              /*!< SCU_INTERRUPT SRSET: ACMP0I Mask        */
#define SCU_INTERRUPT_SRSET_ACMP1I_Pos        5                                                       /*!< SCU_INTERRUPT SRSET: ACMP1I Position    */
#define SCU_INTERRUPT_SRSET_ACMP1I_Msk        (0x01UL << SCU_INTERRUPT_SRSET_ACMP1I_Pos)              /*!< SCU_INTERRUPT SRSET: ACMP1I Mask        */
#define SCU_INTERRUPT_SRSET_ACMP2I_Pos        6                                                       /*!< SCU_INTERRUPT SRSET: ACMP2I Position    */
#define SCU_INTERRUPT_SRSET_ACMP2I_Msk        (0x01UL << SCU_INTERRUPT_SRSET_ACMP2I_Pos)              /*!< SCU_INTERRUPT SRSET: ACMP2I Mask        */
#define SCU_INTERRUPT_SRSET_VDROPI_Pos        7                                                       /*!< SCU_INTERRUPT SRSET: VDROPI Position    */
#define SCU_INTERRUPT_SRSET_VDROPI_Msk        (0x01UL << SCU_INTERRUPT_SRSET_VDROPI_Pos)              /*!< SCU_INTERRUPT SRSET: VDROPI Mask        */
#define SCU_INTERRUPT_SRSET_ORC0I_Pos         8                                                       /*!< SCU_INTERRUPT SRSET: ORC0I Position     */
#define SCU_INTERRUPT_SRSET_ORC0I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_ORC0I_Pos)               /*!< SCU_INTERRUPT SRSET: ORC0I Mask         */
#define SCU_INTERRUPT_SRSET_ORC1I_Pos         9                                                       /*!< SCU_INTERRUPT SRSET: ORC1I Position     */
#define SCU_INTERRUPT_SRSET_ORC1I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_ORC1I_Pos)               /*!< SCU_INTERRUPT SRSET: ORC1I Mask         */
#define SCU_INTERRUPT_SRSET_ORC2I_Pos         10                                                      /*!< SCU_INTERRUPT SRSET: ORC2I Position     */
#define SCU_INTERRUPT_SRSET_ORC2I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_ORC2I_Pos)               /*!< SCU_INTERRUPT SRSET: ORC2I Mask         */
#define SCU_INTERRUPT_SRSET_ORC3I_Pos         11                                                      /*!< SCU_INTERRUPT SRSET: ORC3I Position     */
#define SCU_INTERRUPT_SRSET_ORC3I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_ORC3I_Pos)               /*!< SCU_INTERRUPT SRSET: ORC3I Mask         */
#define SCU_INTERRUPT_SRSET_ORC4I_Pos         12                                                      /*!< SCU_INTERRUPT SRSET: ORC4I Position     */
#define SCU_INTERRUPT_SRSET_ORC4I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_ORC4I_Pos)               /*!< SCU_INTERRUPT SRSET: ORC4I Mask         */
#define SCU_INTERRUPT_SRSET_ORC5I_Pos         13                                                      /*!< SCU_INTERRUPT SRSET: ORC5I Position     */
#define SCU_INTERRUPT_SRSET_ORC5I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_ORC5I_Pos)               /*!< SCU_INTERRUPT SRSET: ORC5I Mask         */
#define SCU_INTERRUPT_SRSET_ORC6I_Pos         14                                                      /*!< SCU_INTERRUPT SRSET: ORC6I Position     */
#define SCU_INTERRUPT_SRSET_ORC6I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_ORC6I_Pos)               /*!< SCU_INTERRUPT SRSET: ORC6I Mask         */
#define SCU_INTERRUPT_SRSET_ORC7I_Pos         15                                                      /*!< SCU_INTERRUPT SRSET: ORC7I Position     */
#define SCU_INTERRUPT_SRSET_ORC7I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_ORC7I_Pos)               /*!< SCU_INTERRUPT SRSET: ORC7I Mask         */
#define SCU_INTERRUPT_SRSET_LOCI_Pos          16                                                      /*!< SCU_INTERRUPT SRSET: LOCI Position      */
#define SCU_INTERRUPT_SRSET_LOCI_Msk          (0x01UL << SCU_INTERRUPT_SRSET_LOCI_Pos)                /*!< SCU_INTERRUPT SRSET: LOCI Mask          */
#define SCU_INTERRUPT_SRSET_PESRAMI_Pos       17                                                      /*!< SCU_INTERRUPT SRSET: PESRAMI Position   */
#define SCU_INTERRUPT_SRSET_PESRAMI_Msk       (0x01UL << SCU_INTERRUPT_SRSET_PESRAMI_Pos)             /*!< SCU_INTERRUPT SRSET: PESRAMI Mask       */
#define SCU_INTERRUPT_SRSET_PEU0I_Pos         18                                                      /*!< SCU_INTERRUPT SRSET: PEU0I Position     */
#define SCU_INTERRUPT_SRSET_PEU0I_Msk         (0x01UL << SCU_INTERRUPT_SRSET_PEU0I_Pos)               /*!< SCU_INTERRUPT SRSET: PEU0I Mask         */
#define SCU_INTERRUPT_SRSET_FLECC2I_Pos       19                                                      /*!< SCU_INTERRUPT SRSET: FLECC2I Position   */
#define SCU_INTERRUPT_SRSET_FLECC2I_Msk       (0x01UL << SCU_INTERRUPT_SRSET_FLECC2I_Pos)             /*!< SCU_INTERRUPT SRSET: FLECC2I Mask       */
#define SCU_INTERRUPT_SRSET_FLCMPLTI_Pos      20                                                      /*!< SCU_INTERRUPT SRSET: FLCMPLTI Position  */
#define SCU_INTERRUPT_SRSET_FLCMPLTI_Msk      (0x01UL << SCU_INTERRUPT_SRSET_FLCMPLTI_Pos)            /*!< SCU_INTERRUPT SRSET: FLCMPLTI Mask      */
#define SCU_INTERRUPT_SRSET_VCLIPI_Pos        21                                                      /*!< SCU_INTERRUPT SRSET: VCLIPI Position    */
#define SCU_INTERRUPT_SRSET_VCLIPI_Msk        (0x01UL << SCU_INTERRUPT_SRSET_VCLIPI_Pos)              /*!< SCU_INTERRUPT SRSET: VCLIPI Mask        */
#define SCU_INTERRUPT_SRSET_SBYCLKFI_Pos      22                                                      /*!< SCU_INTERRUPT SRSET: SBYCLKFI Position  */
#define SCU_INTERRUPT_SRSET_SBYCLKFI_Msk      (0x01UL << SCU_INTERRUPT_SRSET_SBYCLKFI_Pos)            /*!< SCU_INTERRUPT SRSET: SBYCLKFI Mask      */
#define SCU_INTERRUPT_SRSET_RTC_CTR_Pos       24                                                      /*!< SCU_INTERRUPT SRSET: RTC_CTR Position   */
#define SCU_INTERRUPT_SRSET_RTC_CTR_Msk       (0x01UL << SCU_INTERRUPT_SRSET_RTC_CTR_Pos)             /*!< SCU_INTERRUPT SRSET: RTC_CTR Mask       */
#define SCU_INTERRUPT_SRSET_RTC_ATIM0_Pos     25                                                      /*!< SCU_INTERRUPT SRSET: RTC_ATIM0 Position */
#define SCU_INTERRUPT_SRSET_RTC_ATIM0_Msk     (0x01UL << SCU_INTERRUPT_SRSET_RTC_ATIM0_Pos)           /*!< SCU_INTERRUPT SRSET: RTC_ATIM0 Mask     */
#define SCU_INTERRUPT_SRSET_RTC_ATIM1_Pos     26                                                      /*!< SCU_INTERRUPT SRSET: RTC_ATIM1 Position */
#define SCU_INTERRUPT_SRSET_RTC_ATIM1_Msk     (0x01UL << SCU_INTERRUPT_SRSET_RTC_ATIM1_Pos)           /*!< SCU_INTERRUPT SRSET: RTC_ATIM1 Mask     */
#define SCU_INTERRUPT_SRSET_RTC_TIM0_Pos      27                                                      /*!< SCU_INTERRUPT SRSET: RTC_TIM0 Position  */
#define SCU_INTERRUPT_SRSET_RTC_TIM0_Msk      (0x01UL << SCU_INTERRUPT_SRSET_RTC_TIM0_Pos)            /*!< SCU_INTERRUPT SRSET: RTC_TIM0 Mask      */
#define SCU_INTERRUPT_SRSET_RTC_TIM1_Pos      28                                                      /*!< SCU_INTERRUPT SRSET: RTC_TIM1 Position  */
#define SCU_INTERRUPT_SRSET_RTC_TIM1_Msk      (0x01UL << SCU_INTERRUPT_SRSET_RTC_TIM1_Pos)            /*!< SCU_INTERRUPT SRSET: RTC_TIM1 Mask      */
#define SCU_INTERRUPT_SRSET_TSE_DONE_Pos      29                                                      /*!< SCU_INTERRUPT SRSET: TSE_DONE Position  */
#define SCU_INTERRUPT_SRSET_TSE_DONE_Msk      (0x01UL << SCU_INTERRUPT_SRSET_TSE_DONE_Pos)            /*!< SCU_INTERRUPT SRSET: TSE_DONE Mask      */
#define SCU_INTERRUPT_SRSET_TSE_HIGH_Pos      30                                                      /*!< SCU_INTERRUPT SRSET: TSE_HIGH Position  */
#define SCU_INTERRUPT_SRSET_TSE_HIGH_Msk      (0x01UL << SCU_INTERRUPT_SRSET_TSE_HIGH_Pos)            /*!< SCU_INTERRUPT SRSET: TSE_HIGH Mask      */
#define SCU_INTERRUPT_SRSET_TSE_LOW_Pos       31                                                      /*!< SCU_INTERRUPT SRSET: TSE_LOW Position   */
#define SCU_INTERRUPT_SRSET_TSE_LOW_Msk       (0x01UL << SCU_INTERRUPT_SRSET_TSE_LOW_Pos)             /*!< SCU_INTERRUPT SRSET: TSE_LOW Mask       */


/* ================================================================================ */
/* ================       struct 'SCU_POWER' Position & Mask       ================ */
/* ================================================================================ */


