FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* -------------------------------  SCU_POWER_VDESR  ------------------------------ */
#define SCU_POWER_VDESR_VCLIP_Pos             0                                                       /*!< SCU_POWER VDESR: VCLIP Position         */
#define SCU_POWER_VDESR_VCLIP_Msk             (0x01UL << SCU_POWER_VDESR_VCLIP_Pos)                   /*!< SCU_POWER VDESR: VCLIP Mask             */
#define SCU_POWER_VDESR_VDDPPW_Pos            1                                                       /*!< SCU_POWER VDESR: VDDPPW Position        */
#define SCU_POWER_VDESR_VDDPPW_Msk            (0x01UL << SCU_POWER_VDESR_VDDPPW_Pos)                  /*!< SCU_POWER VDESR: VDDPPW Mask            */


/* ================================================================================ */
/* ================        struct 'SCU_CLK' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  SCU_CLK_CLKCR  ------------------------------- */
#define SCU_CLK_CLKCR_FDIV_Pos                0                                                       /*!< SCU_CLK CLKCR: FDIV Position            */
#define SCU_CLK_CLKCR_FDIV_Msk                (0x000000ffUL << SCU_CLK_CLKCR_FDIV_Pos)                /*!< SCU_CLK CLKCR: FDIV Mask                */
#define SCU_CLK_CLKCR_IDIV_Pos                8                                                       /*!< SCU_CLK CLKCR: IDIV Position            */
#define SCU_CLK_CLKCR_IDIV_Msk                (0x000000ffUL << SCU_CLK_CLKCR_IDIV_Pos)                /*!< SCU_CLK CLKCR: IDIV Mask                */
#define SCU_CLK_CLKCR_PCLKSEL_Pos             16                                                      /*!< SCU_CLK CLKCR: PCLKSEL Position         */
#define SCU_CLK_CLKCR_PCLKSEL_Msk             (0x01UL << SCU_CLK_CLKCR_PCLKSEL_Pos)                   /*!< SCU_CLK CLKCR: PCLKSEL Mask             */
#define SCU_CLK_CLKCR_RTCCLKSEL_Pos           17                                                      /*!< SCU_CLK CLKCR: RTCCLKSEL Position       */
#define SCU_CLK_CLKCR_RTCCLKSEL_Msk           (0x07UL << SCU_CLK_CLKCR_RTCCLKSEL_Pos)                 /*!< SCU_CLK CLKCR: RTCCLKSEL Mask           */
#define SCU_CLK_CLKCR_CNTADJ_Pos              20                                                      /*!< SCU_CLK CLKCR: CNTADJ Position          */
#define SCU_CLK_CLKCR_CNTADJ_Msk              (0x000003ffUL << SCU_CLK_CLKCR_CNTADJ_Pos)              /*!< SCU_CLK CLKCR: CNTADJ Mask              */
#define SCU_CLK_CLKCR_VDDC2LOW_Pos            30                                                      /*!< SCU_CLK CLKCR: VDDC2LOW Position        */
#define SCU_CLK_CLKCR_VDDC2LOW_Msk            (0x01UL << SCU_CLK_CLKCR_VDDC2LOW_Pos)                  /*!< SCU_CLK CLKCR: VDDC2LOW Mask            */
#define SCU_CLK_CLKCR_VDDC2HIGH_Pos           31                                                      /*!< SCU_CLK CLKCR: VDDC2HIGH Position       */
#define SCU_CLK_CLKCR_VDDC2HIGH_Msk           (0x01UL << SCU_CLK_CLKCR_VDDC2HIGH_Pos)                 /*!< SCU_CLK CLKCR: VDDC2HIGH Mask           */

/* -------------------------------  SCU_CLK_PWRSVCR  ------------------------------ */
#define SCU_CLK_PWRSVCR_FPD_Pos               0                                                       /*!< SCU_CLK PWRSVCR: FPD Position           */
#define SCU_CLK_PWRSVCR_FPD_Msk               (0x01UL << SCU_CLK_PWRSVCR_FPD_Pos)                     /*!< SCU_CLK PWRSVCR: FPD Mask               */

/* ------------------------------  SCU_CLK_CGATSTAT0  ----------------------------- */
#define SCU_CLK_CGATSTAT0_VADC_Pos            0                                                       /*!< SCU_CLK CGATSTAT0: VADC Position        */
#define SCU_CLK_CGATSTAT0_VADC_Msk            (0x01UL << SCU_CLK_CGATSTAT0_VADC_Pos)                  /*!< SCU_CLK CGATSTAT0: VADC Mask            */
#define SCU_CLK_CGATSTAT0_CCU80_Pos           1                                                       /*!< SCU_CLK CGATSTAT0: CCU80 Position       */
#define SCU_CLK_CGATSTAT0_CCU80_Msk           (0x01UL << SCU_CLK_CGATSTAT0_CCU80_Pos)                 /*!< SCU_CLK CGATSTAT0: CCU80 Mask           */
#define SCU_CLK_CGATSTAT0_CCU40_Pos           2                                                       /*!< SCU_CLK CGATSTAT0: CCU40 Position       */
#define SCU_CLK_CGATSTAT0_CCU40_Msk           (0x01UL << SCU_CLK_CGATSTAT0_CCU40_Pos)                 /*!< SCU_CLK CGATSTAT0: CCU40 Mask           */
#define SCU_CLK_CGATSTAT0_USIC0_Pos           3                                                       /*!< SCU_CLK CGATSTAT0: USIC0 Position       */
#define SCU_CLK_CGATSTAT0_USIC0_Msk           (0x01UL << SCU_CLK_CGATSTAT0_USIC0_Pos)                 /*!< SCU_CLK CGATSTAT0: USIC0 Mask           */
#define SCU_CLK_CGATSTAT0_BCCU0_Pos           4                                                       /*!< SCU_CLK CGATSTAT0: BCCU0 Position       */
#define SCU_CLK_CGATSTAT0_BCCU0_Msk           (0x01UL << SCU_CLK_CGATSTAT0_BCCU0_Pos)                 /*!< SCU_CLK CGATSTAT0: BCCU0 Mask           */
#define SCU_CLK_CGATSTAT0_POSIF0_Pos          7                                                       /*!< SCU_CLK CGATSTAT0: POSIF0 Position      */
#define SCU_CLK_CGATSTAT0_POSIF0_Msk          (0x01UL << SCU_CLK_CGATSTAT0_POSIF0_Pos)                /*!< SCU_CLK CGATSTAT0: POSIF0 Mask          */
#define SCU_CLK_CGATSTAT0_MATH_Pos            8                                                       /*!< SCU_CLK CGATSTAT0: MATH Position        */
#define SCU_CLK_CGATSTAT0_MATH_Msk            (0x01UL << SCU_CLK_CGATSTAT0_MATH_Pos)                  /*!< SCU_CLK CGATSTAT0: MATH Mask            */
#define SCU_CLK_CGATSTAT0_WDT_Pos             9                                                       /*!< SCU_CLK CGATSTAT0: WDT Position         */
#define SCU_CLK_CGATSTAT0_WDT_Msk             (0x01UL << SCU_CLK_CGATSTAT0_WDT_Pos)                   /*!< SCU_CLK CGATSTAT0: WDT Mask             */
#define SCU_CLK_CGATSTAT0_RTC_Pos             10                                                      /*!< SCU_CLK CGATSTAT0: RTC Position         */
#define SCU_CLK_CGATSTAT0_RTC_Msk             (0x01UL << SCU_CLK_CGATSTAT0_RTC_Pos)                   /*!< SCU_CLK CGATSTAT0: RTC Mask             */

