FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* ------------------------------  SCU_CLK_CGATSET0  ------------------------------ */
#define SCU_CLK_CGATSET0_VADC_Pos             0                                                       /*!< SCU_CLK CGATSET0: VADC Position         */
#define SCU_CLK_CGATSET0_VADC_Msk             (0x01UL << SCU_CLK_CGATSET0_VADC_Pos)                   /*!< SCU_CLK CGATSET0: VADC Mask             */
#define SCU_CLK_CGATSET0_CCU80_Pos            1                                                       /*!< SCU_CLK CGATSET0: CCU80 Position        */
#define SCU_CLK_CGATSET0_CCU80_Msk            (0x01UL << SCU_CLK_CGATSET0_CCU80_Pos)                  /*!< SCU_CLK CGATSET0: CCU80 Mask            */
#define SCU_CLK_CGATSET0_CCU40_Pos            2                                                       /*!< SCU_CLK CGATSET0: CCU40 Position        */
#define SCU_CLK_CGATSET0_CCU40_Msk            (0x01UL << SCU_CLK_CGATSET0_CCU40_Pos)                  /*!< SCU_CLK CGATSET0: CCU40 Mask            */
#define SCU_CLK_CGATSET0_USIC0_Pos            3                                                       /*!< SCU_CLK CGATSET0: USIC0 Position        */
#define SCU_CLK_CGATSET0_USIC0_Msk            (0x01UL << SCU_CLK_CGATSET0_USIC0_Pos)                  /*!< SCU_CLK CGATSET0: USIC0 Mask            */
#define SCU_CLK_CGATSET0_BCCU0_Pos            4                                                       /*!< SCU_CLK CGATSET0: BCCU0 Position        */
#define SCU_CLK_CGATSET0_BCCU0_Msk            (0x01UL << SCU_CLK_CGATSET0_BCCU0_Pos)                  /*!< SCU_CLK CGATSET0: BCCU0 Mask            */
#define SCU_CLK_CGATSET0_POSIF0_Pos           7                                                       /*!< SCU_CLK CGATSET0: POSIF0 Position       */
#define SCU_CLK_CGATSET0_POSIF0_Msk           (0x01UL << SCU_CLK_CGATSET0_POSIF0_Pos)                 /*!< SCU_CLK CGATSET0: POSIF0 Mask           */
#define SCU_CLK_CGATSET0_MATH_Pos             8                                                       /*!< SCU_CLK CGATSET0: MATH Position         */
#define SCU_CLK_CGATSET0_MATH_Msk             (0x01UL << SCU_CLK_CGATSET0_MATH_Pos)                   /*!< SCU_CLK CGATSET0: MATH Mask             */
#define SCU_CLK_CGATSET0_WDT_Pos              9                                                       /*!< SCU_CLK CGATSET0: WDT Position          */
#define SCU_CLK_CGATSET0_WDT_Msk              (0x01UL << SCU_CLK_CGATSET0_WDT_Pos)                    /*!< SCU_CLK CGATSET0: WDT Mask              */
#define SCU_CLK_CGATSET0_RTC_Pos              10                                                      /*!< SCU_CLK CGATSET0: RTC Position          */
#define SCU_CLK_CGATSET0_RTC_Msk              (0x01UL << SCU_CLK_CGATSET0_RTC_Pos)                    /*!< SCU_CLK CGATSET0: RTC Mask              */

/* ------------------------------  SCU_CLK_CGATCLR0  ------------------------------ */
#define SCU_CLK_CGATCLR0_VADC_Pos             0                                                       /*!< SCU_CLK CGATCLR0: VADC Position         */
#define SCU_CLK_CGATCLR0_VADC_Msk             (0x01UL << SCU_CLK_CGATCLR0_VADC_Pos)                   /*!< SCU_CLK CGATCLR0: VADC Mask             */
#define SCU_CLK_CGATCLR0_CCU80_Pos            1                                                       /*!< SCU_CLK CGATCLR0: CCU80 Position        */
#define SCU_CLK_CGATCLR0_CCU80_Msk            (0x01UL << SCU_CLK_CGATCLR0_CCU80_Pos)                  /*!< SCU_CLK CGATCLR0: CCU80 Mask            */
#define SCU_CLK_CGATCLR0_CCU40_Pos            2                                                       /*!< SCU_CLK CGATCLR0: CCU40 Position        */
#define SCU_CLK_CGATCLR0_CCU40_Msk            (0x01UL << SCU_CLK_CGATCLR0_CCU40_Pos)                  /*!< SCU_CLK CGATCLR0: CCU40 Mask            */
#define SCU_CLK_CGATCLR0_USIC0_Pos            3                                                       /*!< SCU_CLK CGATCLR0: USIC0 Position        */
#define SCU_CLK_CGATCLR0_USIC0_Msk            (0x01UL << SCU_CLK_CGATCLR0_USIC0_Pos)                  /*!< SCU_CLK CGATCLR0: USIC0 Mask            */
#define SCU_CLK_CGATCLR0_BCCU0_Pos            4                                                       /*!< SCU_CLK CGATCLR0: BCCU0 Position        */
#define SCU_CLK_CGATCLR0_BCCU0_Msk            (0x01UL << SCU_CLK_CGATCLR0_BCCU0_Pos)                  /*!< SCU_CLK CGATCLR0: BCCU0 Mask            */
#define SCU_CLK_CGATCLR0_POSIF0_Pos           7                                                       /*!< SCU_CLK CGATCLR0: POSIF0 Position       */
#define SCU_CLK_CGATCLR0_POSIF0_Msk           (0x01UL << SCU_CLK_CGATCLR0_POSIF0_Pos)                 /*!< SCU_CLK CGATCLR0: POSIF0 Mask           */
#define SCU_CLK_CGATCLR0_MATH_Pos             8                                                       /*!< SCU_CLK CGATCLR0: MATH Position         */
#define SCU_CLK_CGATCLR0_MATH_Msk             (0x01UL << SCU_CLK_CGATCLR0_MATH_Pos)                   /*!< SCU_CLK CGATCLR0: MATH Mask             */
#define SCU_CLK_CGATCLR0_WDT_Pos              9                                                       /*!< SCU_CLK CGATCLR0: WDT Position          */
#define SCU_CLK_CGATCLR0_WDT_Msk              (0x01UL << SCU_CLK_CGATCLR0_WDT_Pos)                    /*!< SCU_CLK CGATCLR0: WDT Mask              */
#define SCU_CLK_CGATCLR0_RTC_Pos              10                                                      /*!< SCU_CLK CGATCLR0: RTC Position          */
#define SCU_CLK_CGATCLR0_RTC_Msk              (0x01UL << SCU_CLK_CGATCLR0_RTC_Pos)                    /*!< SCU_CLK CGATCLR0: RTC Mask              */

/* -------------------------------  SCU_CLK_OSCCSR  ------------------------------- */
#define SCU_CLK_OSCCSR_OSC2L_Pos              0                                                       /*!< SCU_CLK OSCCSR: OSC2L Position          */
#define SCU_CLK_OSCCSR_OSC2L_Msk              (0x01UL << SCU_CLK_OSCCSR_OSC2L_Pos)                    /*!< SCU_CLK OSCCSR: OSC2L Mask              */
#define SCU_CLK_OSCCSR_OSC2H_Pos              1                                                       /*!< SCU_CLK OSCCSR: OSC2H Position          */
#define SCU_CLK_OSCCSR_OSC2H_Msk              (0x01UL << SCU_CLK_OSCCSR_OSC2H_Pos)                    /*!< SCU_CLK OSCCSR: OSC2H Mask              */
#define SCU_CLK_OSCCSR_OWDRES_Pos             16                                                      /*!< SCU_CLK OSCCSR: OWDRES Position         */
#define SCU_CLK_OSCCSR_OWDRES_Msk             (0x01UL << SCU_CLK_OSCCSR_OWDRES_Pos)                   /*!< SCU_CLK OSCCSR: OWDRES Mask             */
#define SCU_CLK_OSCCSR_OWDEN_Pos              17                                                      /*!< SCU_CLK OSCCSR: OWDEN Position          */
#define SCU_CLK_OSCCSR_OWDEN_Msk              (0x01UL << SCU_CLK_OSCCSR_OWDEN_Pos)                    /*!< SCU_CLK OSCCSR: OWDEN Mask              */


/* ================================================================================ */
/* ================       struct 'SCU_RESET' Position & Mask       ================ */
/* ================================================================================ */


/* ------------------------------  SCU_RESET_RSTSTAT  ----------------------------- */
#define SCU_RESET_RSTSTAT_RSTSTAT_Pos         0                                                       /*!< SCU_RESET RSTSTAT: RSTSTAT Position     */
#define SCU_RESET_RSTSTAT_RSTSTAT_Msk         (0x000003ffUL << SCU_RESET_RSTSTAT_RSTSTAT_Pos)         /*!< SCU_RESET RSTSTAT: RSTSTAT Mask         */
#define SCU_RESET_RSTSTAT_LCKEN_Pos           10                                                      /*!< SCU_RESET RSTSTAT: LCKEN Position       */
#define SCU_RESET_RSTSTAT_LCKEN_Msk           (0x01UL << SCU_RESET_RSTSTAT_LCKEN_Pos)                 /*!< SCU_RESET RSTSTAT: LCKEN Mask           */

/* ------------------------------  SCU_RESET_RSTSET  ------------------------------ */
#define SCU_RESET_RSTSET_LCKEN_Pos            10                                                      /*!< SCU_RESET RSTSET: LCKEN Position        */
#define SCU_RESET_RSTSET_LCKEN_Msk            (0x01UL << SCU_RESET_RSTSET_LCKEN_Pos)                  /*!< SCU_RESET RSTSET: LCKEN Mask            */

/* ------------------------------  SCU_RESET_RSTCLR  ------------------------------ */
#define SCU_RESET_RSTCLR_RSCLR_Pos            0                                                       /*!< SCU_RESET RSTCLR: RSCLR Position        */
#define SCU_RESET_RSTCLR_RSCLR_Msk            (0x01UL << SCU_RESET_RSTCLR_RSCLR_Pos)                  /*!< SCU_RESET RSTCLR: RSCLR Mask            */
#define SCU_RESET_RSTCLR_LCKEN_Pos            10                                                      /*!< SCU_RESET RSTCLR: LCKEN Position        */
#define SCU_RESET_RSTCLR_LCKEN_Msk            (0x01UL << SCU_RESET_RSTCLR_LCKEN_Pos)                  /*!< SCU_RESET RSTCLR: LCKEN Mask            */

/* ------------------------------  SCU_RESET_RSTCON  ------------------------------ */
#define SCU_RESET_RSTCON_ECCRSTEN_Pos         0                                                       /*!< SCU_RESET RSTCON: ECCRSTEN Position     */
#define SCU_RESET_RSTCON_ECCRSTEN_Msk         (0x01UL << SCU_RESET_RSTCON_ECCRSTEN_Pos)               /*!< SCU_RESET RSTCON: ECCRSTEN Mask         */
#define SCU_RESET_RSTCON_LOCRSTEN_Pos         1                                                       /*!< SCU_RESET RSTCON: LOCRSTEN Position     */
#define SCU_RESET_RSTCON_LOCRSTEN_Msk         (0x01UL << SCU_RESET_RSTCON_LOCRSTEN_Pos)               /*!< SCU_RESET RSTCON: LOCRSTEN Mask         */
#define SCU_RESET_RSTCON_SPERSTEN_Pos         2                                                       /*!< SCU_RESET RSTCON: SPERSTEN Position     */
#define SCU_RESET_RSTCON_SPERSTEN_Msk         (0x01UL << SCU_RESET_RSTCON_SPERSTEN_Pos)               /*!< SCU_RESET RSTCON: SPERSTEN Mask         */
#define SCU_RESET_RSTCON_U0PERSTEN_Pos        3                                                       /*!< SCU_RESET RSTCON: U0PERSTEN Position    */
#define SCU_RESET_RSTCON_U0PERSTEN_Msk        (0x01UL << SCU_RESET_RSTCON_U0PERSTEN_Pos)              /*!< SCU_RESET RSTCON: U0PERSTEN Mask        */
#define SCU_RESET_RSTCON_MRSTEN_Pos           16                                                      /*!< SCU_RESET RSTCON: MRSTEN Position       */
#define SCU_RESET_RSTCON_MRSTEN_Msk           (0x01UL << SCU_RESET_RSTCON_MRSTEN_Pos)                 /*!< SCU_RESET RSTCON: MRSTEN Mask           */


/* ================================================================================ */
/* ================       struct 'COMPARATOR' Position & Mask      ================ */
/* ================================================================================ */


/* -----------------------------  COMPARATOR_ORCCTRL  ----------------------------- */
#define COMPARATOR_ORCCTRL_ENORC0_Pos         0                                                       /*!< COMPARATOR ORCCTRL: ENORC0 Position     */
#define COMPARATOR_ORCCTRL_ENORC0_Msk         (0x01UL << COMPARATOR_ORCCTRL_ENORC0_Pos)               /*!< COMPARATOR ORCCTRL: ENORC0 Mask         */
#define COMPARATOR_ORCCTRL_ENORC1_Pos         1                                                       /*!< COMPARATOR ORCCTRL: ENORC1 Position     */
#define COMPARATOR_ORCCTRL_ENORC1_Msk         (0x01UL << COMPARATOR_ORCCTRL_ENORC1_Pos)               /*!< COMPARATOR ORCCTRL: ENORC1 Mask         */
#define COMPARATOR_ORCCTRL_ENORC2_Pos         2                                                       /*!< COMPARATOR ORCCTRL: ENORC2 Position     */
#define COMPARATOR_ORCCTRL_ENORC2_Msk         (0x01UL << COMPARATOR_ORCCTRL_ENORC2_Pos)               /*!< COMPARATOR ORCCTRL: ENORC2 Mask         */
#define COMPARATOR_ORCCTRL_ENORC3_Pos         3                                                       /*!< COMPARATOR ORCCTRL: ENORC3 Position     */
#define COMPARATOR_ORCCTRL_ENORC3_Msk         (0x01UL << COMPARATOR_ORCCTRL_ENORC3_Pos)               /*!< COMPARATOR ORCCTRL: ENORC3 Mask         */
#define COMPARATOR_ORCCTRL_ENORC4_Pos         4                                                       /*!< COMPARATOR ORCCTRL: ENORC4 Position     */
#define COMPARATOR_ORCCTRL_ENORC4_Msk         (0x01UL << COMPARATOR_ORCCTRL_ENORC4_Pos)               /*!< COMPARATOR ORCCTRL: ENORC4 Mask         */
#define COMPARATOR_ORCCTRL_ENORC5_Pos         5                                                       /*!< COMPARATOR ORCCTRL: ENORC5 Position     */
#define COMPARATOR_ORCCTRL_ENORC5_Msk         (0x01UL << COMPARATOR_ORCCTRL_ENORC5_Pos)               /*!< COMPARATOR ORCCTRL: ENORC5 Mask         */
#define COMPARATOR_ORCCTRL_ENORC6_Pos         6                                                       /*!< COMPARATOR ORCCTRL: ENORC6 Position     */
#define COMPARATOR_ORCCTRL_ENORC6_Msk         (0x01UL << COMPARATOR_ORCCTRL_ENORC6_Pos)               /*!< COMPARATOR ORCCTRL: ENORC6 Mask         */
#define COMPARATOR_ORCCTRL_ENORC7_Pos         7                                                       /*!< COMPARATOR ORCCTRL: ENORC7 Position     */
#define COMPARATOR_ORCCTRL_ENORC7_Msk         (0x01UL << COMPARATOR_ORCCTRL_ENORC7_Pos)               /*!< COMPARATOR ORCCTRL: ENORC7 Mask         */
#define COMPARATOR_ORCCTRL_CNF0_Pos           16                                                      /*!< COMPARATOR ORCCTRL: CNF0 Position       */
#define COMPARATOR_ORCCTRL_CNF0_Msk           (0x01UL << COMPARATOR_ORCCTRL_CNF0_Pos)                 /*!< COMPARATOR ORCCTRL: CNF0 Mask           */
#define COMPARATOR_ORCCTRL_CNF1_Pos           17                                                      /*!< COMPARATOR ORCCTRL: CNF1 Position       */
#define COMPARATOR_ORCCTRL_CNF1_Msk           (0x01UL << COMPARATOR_ORCCTRL_CNF1_Pos)                 /*!< COMPARATOR ORCCTRL: CNF1 Mask           */
#define COMPARATOR_ORCCTRL_CNF2_Pos           18                                                      /*!< COMPARATOR ORCCTRL: CNF2 Position       */
#define COMPARATOR_ORCCTRL_CNF2_Msk           (0x01UL << COMPARATOR_ORCCTRL_CNF2_Pos)                 /*!< COMPARATOR ORCCTRL: CNF2 Mask           */
#define COMPARATOR_ORCCTRL_CNF3_Pos           19                                                      /*!< COMPARATOR ORCCTRL: CNF3 Position       */
#define COMPARATOR_ORCCTRL_CNF3_Msk           (0x01UL << COMPARATOR_ORCCTRL_CNF3_Pos)                 /*!< COMPARATOR ORCCTRL: CNF3 Mask           */
#define COMPARATOR_ORCCTRL_CNF4_Pos           20                                                      /*!< COMPARATOR ORCCTRL: CNF4 Position       */
#define COMPARATOR_ORCCTRL_CNF4_Msk           (0x01UL << COMPARATOR_ORCCTRL_CNF4_Pos)                 /*!< COMPARATOR ORCCTRL: CNF4 Mask           */
#define COMPARATOR_ORCCTRL_CNF5_Pos           21                                                      /*!< COMPARATOR ORCCTRL: CNF5 Position       */
#define COMPARATOR_ORCCTRL_CNF5_Msk           (0x01UL << COMPARATOR_ORCCTRL_CNF5_Pos)                 /*!< COMPARATOR ORCCTRL: CNF5 Mask           */
#define COMPARATOR_ORCCTRL_CNF6_Pos           22                                                      /*!< COMPARATOR ORCCTRL: CNF6 Position       */
#define COMPARATOR_ORCCTRL_CNF6_Msk           (0x01UL << COMPARATOR_ORCCTRL_CNF6_Pos)                 /*!< COMPARATOR ORCCTRL: CNF6 Mask           */
#define COMPARATOR_ORCCTRL_CNF7_Pos           23                                                      /*!< COMPARATOR ORCCTRL: CNF7 Position       */
#define COMPARATOR_ORCCTRL_CNF7_Msk           (0x01UL << COMPARATOR_ORCCTRL_CNF7_Pos)                 /*!< COMPARATOR ORCCTRL: CNF7 Mask           */

