FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* -----------------------------  COMPARATOR_ANACMP0  ----------------------------- */
#define COMPARATOR_ANACMP0_CMP_EN_Pos         0                                                       /*!< COMPARATOR ANACMP0: CMP_EN Position     */
#define COMPARATOR_ANACMP0_CMP_EN_Msk         (0x01UL << COMPARATOR_ANACMP0_CMP_EN_Pos)               /*!< COMPARATOR ANACMP0: CMP_EN Mask         */
#define COMPARATOR_ANACMP0_CMP_FLT_OFF_Pos    1                                                       /*!< COMPARATOR ANACMP0: CMP_FLT_OFF Position */
#define COMPARATOR_ANACMP0_CMP_FLT_OFF_Msk    (0x01UL << COMPARATOR_ANACMP0_CMP_FLT_OFF_Pos)          /*!< COMPARATOR ANACMP0: CMP_FLT_OFF Mask    */
#define COMPARATOR_ANACMP0_CMP_INV_OUT_Pos    3                                                       /*!< COMPARATOR ANACMP0: CMP_INV_OUT Position */
#define COMPARATOR_ANACMP0_CMP_INV_OUT_Msk    (0x01UL << COMPARATOR_ANACMP0_CMP_INV_OUT_Pos)          /*!< COMPARATOR ANACMP0: CMP_INV_OUT Mask    */
#define COMPARATOR_ANACMP0_CMP_HYST_ADJ_Pos   4                                                       /*!< COMPARATOR ANACMP0: CMP_HYST_ADJ Position */
#define COMPARATOR_ANACMP0_CMP_HYST_ADJ_Msk   (0x03UL << COMPARATOR_ANACMP0_CMP_HYST_ADJ_Pos)         /*!< COMPARATOR ANACMP0: CMP_HYST_ADJ Mask   */
#define COMPARATOR_ANACMP0_ACMP0_SEL_Pos      6                                                       /*!< COMPARATOR ANACMP0: ACMP0_SEL Position  */
#define COMPARATOR_ANACMP0_ACMP0_SEL_Msk      (0x01UL << COMPARATOR_ANACMP0_ACMP0_SEL_Pos)            /*!< COMPARATOR ANACMP0: ACMP0_SEL Mask      */
#define COMPARATOR_ANACMP0_CMP_LPWR_Pos       8                                                       /*!< COMPARATOR ANACMP0: CMP_LPWR Position   */
#define COMPARATOR_ANACMP0_CMP_LPWR_Msk       (0x01UL << COMPARATOR_ANACMP0_CMP_LPWR_Pos)             /*!< COMPARATOR ANACMP0: CMP_LPWR Mask       */
#define COMPARATOR_ANACMP0_CMP_OUT_Pos        15                                                      /*!< COMPARATOR ANACMP0: CMP_OUT Position    */
#define COMPARATOR_ANACMP0_CMP_OUT_Msk        (0x01UL << COMPARATOR_ANACMP0_CMP_OUT_Pos)              /*!< COMPARATOR ANACMP0: CMP_OUT Mask        */

/* -----------------------------  COMPARATOR_ANACMP1  ----------------------------- */
#define COMPARATOR_ANACMP1_CMP_EN_Pos         0                                                       /*!< COMPARATOR ANACMP1: CMP_EN Position     */
#define COMPARATOR_ANACMP1_CMP_EN_Msk         (0x01UL << COMPARATOR_ANACMP1_CMP_EN_Pos)               /*!< COMPARATOR ANACMP1: CMP_EN Mask         */
#define COMPARATOR_ANACMP1_CMP_FLT_OFF_Pos    1                                                       /*!< COMPARATOR ANACMP1: CMP_FLT_OFF Position */
#define COMPARATOR_ANACMP1_CMP_FLT_OFF_Msk    (0x01UL << COMPARATOR_ANACMP1_CMP_FLT_OFF_Pos)          /*!< COMPARATOR ANACMP1: CMP_FLT_OFF Mask    */
#define COMPARATOR_ANACMP1_CMP_INV_OUT_Pos    3                                                       /*!< COMPARATOR ANACMP1: CMP_INV_OUT Position */
#define COMPARATOR_ANACMP1_CMP_INV_OUT_Msk    (0x01UL << COMPARATOR_ANACMP1_CMP_INV_OUT_Pos)          /*!< COMPARATOR ANACMP1: CMP_INV_OUT Mask    */
#define COMPARATOR_ANACMP1_CMP_HYST_ADJ_Pos   4                                                       /*!< COMPARATOR ANACMP1: CMP_HYST_ADJ Position */
#define COMPARATOR_ANACMP1_CMP_HYST_ADJ_Msk   (0x03UL << COMPARATOR_ANACMP1_CMP_HYST_ADJ_Pos)         /*!< COMPARATOR ANACMP1: CMP_HYST_ADJ Mask   */
#define COMPARATOR_ANACMP1_REF_DIV_EN_Pos     6                                                       /*!< COMPARATOR ANACMP1: REF_DIV_EN Position */
#define COMPARATOR_ANACMP1_REF_DIV_EN_Msk     (0x01UL << COMPARATOR_ANACMP1_REF_DIV_EN_Pos)           /*!< COMPARATOR ANACMP1: REF_DIV_EN Mask     */
#define COMPARATOR_ANACMP1_CMP_OUT_Pos        15                                                      /*!< COMPARATOR ANACMP1: CMP_OUT Position    */
#define COMPARATOR_ANACMP1_CMP_OUT_Msk        (0x01UL << COMPARATOR_ANACMP1_CMP_OUT_Pos)              /*!< COMPARATOR ANACMP1: CMP_OUT Mask        */

/* -----------------------------  COMPARATOR_ANACMP2  ----------------------------- */
#define COMPARATOR_ANACMP2_CMP_EN_Pos         0                                                       /*!< COMPARATOR ANACMP2: CMP_EN Position     */
#define COMPARATOR_ANACMP2_CMP_EN_Msk         (0x01UL << COMPARATOR_ANACMP2_CMP_EN_Pos)               /*!< COMPARATOR ANACMP2: CMP_EN Mask         */
#define COMPARATOR_ANACMP2_CMP_FLT_OFF_Pos    1                                                       /*!< COMPARATOR ANACMP2: CMP_FLT_OFF Position */
#define COMPARATOR_ANACMP2_CMP_FLT_OFF_Msk    (0x01UL << COMPARATOR_ANACMP2_CMP_FLT_OFF_Pos)          /*!< COMPARATOR ANACMP2: CMP_FLT_OFF Mask    */
#define COMPARATOR_ANACMP2_CMP_INV_OUT_Pos    3                                                       /*!< COMPARATOR ANACMP2: CMP_INV_OUT Position */
#define COMPARATOR_ANACMP2_CMP_INV_OUT_Msk    (0x01UL << COMPARATOR_ANACMP2_CMP_INV_OUT_Pos)          /*!< COMPARATOR ANACMP2: CMP_INV_OUT Mask    */
#define COMPARATOR_ANACMP2_CMP_HYST_ADJ_Pos   4                                                       /*!< COMPARATOR ANACMP2: CMP_HYST_ADJ Position */
#define COMPARATOR_ANACMP2_CMP_HYST_ADJ_Msk   (0x03UL << COMPARATOR_ANACMP2_CMP_HYST_ADJ_Pos)         /*!< COMPARATOR ANACMP2: CMP_HYST_ADJ Mask   */
#define COMPARATOR_ANACMP2_ACMP2_SEL_Pos      6                                                       /*!< COMPARATOR ANACMP2: ACMP2_SEL Position  */
#define COMPARATOR_ANACMP2_ACMP2_SEL_Msk      (0x01UL << COMPARATOR_ANACMP2_ACMP2_SEL_Pos)            /*!< COMPARATOR ANACMP2: ACMP2_SEL Mask      */
#define COMPARATOR_ANACMP2_CMP_OUT_Pos        15                                                      /*!< COMPARATOR ANACMP2: CMP_OUT Position    */
#define COMPARATOR_ANACMP2_CMP_OUT_Msk        (0x01UL << COMPARATOR_ANACMP2_CMP_OUT_Pos)              /*!< COMPARATOR ANACMP2: CMP_OUT Mask        */


/* ================================================================================ */
/* ================       struct 'SCU_ANALOG' Position & Mask      ================ */
/* ================================================================================ */


/* ----------------------------  SCU_ANALOG_ANATSECTRL  --------------------------- */
#define SCU_ANALOG_ANATSECTRL_TSE_EN_Pos      0                                                       /*!< SCU_ANALOG ANATSECTRL: TSE_EN Position  */
#define SCU_ANALOG_ANATSECTRL_TSE_EN_Msk      (0x01UL << SCU_ANALOG_ANATSECTRL_TSE_EN_Pos)            /*!< SCU_ANALOG ANATSECTRL: TSE_EN Mask      */

/* -----------------------------  SCU_ANALOG_ANATSEIH  ---------------------------- */
#define SCU_ANALOG_ANATSEIH_TSE_IH_Pos        0                                                       /*!< SCU_ANALOG ANATSEIH: TSE_IH Position    */
#define SCU_ANALOG_ANATSEIH_TSE_IH_Msk        (0x0000ffffUL << SCU_ANALOG_ANATSEIH_TSE_IH_Pos)        /*!< SCU_ANALOG ANATSEIH: TSE_IH Mask        */

/* -----------------------------  SCU_ANALOG_ANATSEIL  ---------------------------- */
#define SCU_ANALOG_ANATSEIL_TSE_IL_Pos        0                                                       /*!< SCU_ANALOG ANATSEIL: TSE_IL Position    */
#define SCU_ANALOG_ANATSEIL_TSE_IL_Msk        (0x0000ffffUL << SCU_ANALOG_ANATSEIL_TSE_IL_Pos)        /*!< SCU_ANALOG ANATSEIL: TSE_IL Mask        */

/* ----------------------------  SCU_ANALOG_ANATSEMON  ---------------------------- */
#define SCU_ANALOG_ANATSEMON_TSE_MON_Pos      0                                                       /*!< SCU_ANALOG ANATSEMON: TSE_MON Position  */
#define SCU_ANALOG_ANATSEMON_TSE_MON_Msk      (0x0000ffffUL << SCU_ANALOG_ANATSEMON_TSE_MON_Pos)      /*!< SCU_ANALOG ANATSEMON: TSE_MON Mask      */

/* -----------------------------  SCU_ANALOG_ANAVDEL  ----------------------------- */
#define SCU_ANALOG_ANAVDEL_VDEL_SELECT_Pos    0                                                       /*!< SCU_ANALOG ANAVDEL: VDEL_SELECT Position */
#define SCU_ANALOG_ANAVDEL_VDEL_SELECT_Msk    (0x03UL << SCU_ANALOG_ANAVDEL_VDEL_SELECT_Pos)          /*!< SCU_ANALOG ANAVDEL: VDEL_SELECT Mask    */
#define SCU_ANALOG_ANAVDEL_VDEL_TIM_ADJ_Pos   2                                                       /*!< SCU_ANALOG ANAVDEL: VDEL_TIM_ADJ Position */
#define SCU_ANALOG_ANAVDEL_VDEL_TIM_ADJ_Msk   (0x03UL << SCU_ANALOG_ANAVDEL_VDEL_TIM_ADJ_Pos)         /*!< SCU_ANALOG ANAVDEL: VDEL_TIM_ADJ Mask   */
#define SCU_ANALOG_ANAVDEL_VDEL_EN_Pos        4                                                       /*!< SCU_ANALOG ANAVDEL: VDEL_EN Position    */
#define SCU_ANALOG_ANAVDEL_VDEL_EN_Msk        (0x01UL << SCU_ANALOG_ANAVDEL_VDEL_EN_Pos)              /*!< SCU_ANALOG ANAVDEL: VDEL_EN Mask        */

/* ----------------------------  SCU_ANALOG_ANAOFFSET  ---------------------------- */
#define SCU_ANALOG_ANAOFFSET_ADJL_OFFSET_Pos  0                                                       /*!< SCU_ANALOG ANAOFFSET: ADJL_OFFSET Position */
#define SCU_ANALOG_ANAOFFSET_ADJL_OFFSET_Msk  (0x0fUL << SCU_ANALOG_ANAOFFSET_ADJL_OFFSET_Pos)        /*!< SCU_ANALOG ANAOFFSET: ADJL_OFFSET Mask  */


/* ================================================================================ */
/* ================          Group 'CCU4' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  CCU4_GCTRL  --------------------------------- */
#define CCU4_GCTRL_PRBC_Pos                   0                                                       /*!< CCU4 GCTRL: PRBC Position               */
#define CCU4_GCTRL_PRBC_Msk                   (0x07UL << CCU4_GCTRL_PRBC_Pos)                         /*!< CCU4 GCTRL: PRBC Mask                   */
#define CCU4_GCTRL_PCIS_Pos                   4                                                       /*!< CCU4 GCTRL: PCIS Position               */
#define CCU4_GCTRL_PCIS_Msk                   (0x03UL << CCU4_GCTRL_PCIS_Pos)                         /*!< CCU4 GCTRL: PCIS Mask                   */
#define CCU4_GCTRL_SUSCFG_Pos                 8                                                       /*!< CCU4 GCTRL: SUSCFG Position             */
#define CCU4_GCTRL_SUSCFG_Msk                 (0x03UL << CCU4_GCTRL_SUSCFG_Pos)                       /*!< CCU4 GCTRL: SUSCFG Mask                 */
#define CCU4_GCTRL_MSE0_Pos                   10                                                      /*!< CCU4 GCTRL: MSE0 Position               */
#define CCU4_GCTRL_MSE0_Msk                   (0x01UL << CCU4_GCTRL_MSE0_Pos)                         /*!< CCU4 GCTRL: MSE0 Mask                   */
#define CCU4_GCTRL_MSE1_Pos                   11                                                      /*!< CCU4 GCTRL: MSE1 Position               */
#define CCU4_GCTRL_MSE1_Msk                   (0x01UL << CCU4_GCTRL_MSE1_Pos)                         /*!< CCU4 GCTRL: MSE1 Mask                   */
#define CCU4_GCTRL_MSE2_Pos                   12                                                      /*!< CCU4 GCTRL: MSE2 Position               */
#define CCU4_GCTRL_MSE2_Msk                   (0x01UL << CCU4_GCTRL_MSE2_Pos)                         /*!< CCU4 GCTRL: MSE2 Mask                   */
#define CCU4_GCTRL_MSE3_Pos                   13                                                      /*!< CCU4 GCTRL: MSE3 Position               */
#define CCU4_GCTRL_MSE3_Msk                   (0x01UL << CCU4_GCTRL_MSE3_Pos)                         /*!< CCU4 GCTRL: MSE3 Mask                   */
#define CCU4_GCTRL_MSDE_Pos                   14                                                      /*!< CCU4 GCTRL: MSDE Position               */
#define CCU4_GCTRL_MSDE_Msk                   (0x03UL << CCU4_GCTRL_MSDE_Pos)                         /*!< CCU4 GCTRL: MSDE Mask                   */

/* ---------------------------------  CCU4_GSTAT  --------------------------------- */
#define CCU4_GSTAT_S0I_Pos                    0                                                       /*!< CCU4 GSTAT: S0I Position                */
#define CCU4_GSTAT_S0I_Msk                    (0x01UL << CCU4_GSTAT_S0I_Pos)                          /*!< CCU4 GSTAT: S0I Mask                    */
#define CCU4_GSTAT_S1I_Pos                    1                                                       /*!< CCU4 GSTAT: S1I Position                */
#define CCU4_GSTAT_S1I_Msk                    (0x01UL << CCU4_GSTAT_S1I_Pos)                          /*!< CCU4 GSTAT: S1I Mask                    */
#define CCU4_GSTAT_S2I_Pos                    2                                                       /*!< CCU4 GSTAT: S2I Position                */
#define CCU4_GSTAT_S2I_Msk                    (0x01UL << CCU4_GSTAT_S2I_Pos)                          /*!< CCU4 GSTAT: S2I Mask                    */
#define CCU4_GSTAT_S3I_Pos                    3                                                       /*!< CCU4 GSTAT: S3I Position                */
#define CCU4_GSTAT_S3I_Msk                    (0x01UL << CCU4_GSTAT_S3I_Pos)                          /*!< CCU4 GSTAT: S3I Mask                    */
#define CCU4_GSTAT_PRB_Pos                    8                                                       /*!< CCU4 GSTAT: PRB Position                */
#define CCU4_GSTAT_PRB_Msk                    (0x01UL << CCU4_GSTAT_PRB_Pos)                          /*!< CCU4 GSTAT: PRB Mask                    */

/* ---------------------------------  CCU4_GIDLS  --------------------------------- */
#define CCU4_GIDLS_SS0I_Pos                   0                                                       /*!< CCU4 GIDLS: SS0I Position               */
#define CCU4_GIDLS_SS0I_Msk                   (0x01UL << CCU4_GIDLS_SS0I_Pos)                         /*!< CCU4 GIDLS: SS0I Mask                   */
#define CCU4_GIDLS_SS1I_Pos                   1                                                       /*!< CCU4 GIDLS: SS1I Position               */
#define CCU4_GIDLS_SS1I_Msk                   (0x01UL << CCU4_GIDLS_SS1I_Pos)                         /*!< CCU4 GIDLS: SS1I Mask                   */
#define CCU4_GIDLS_SS2I_Pos                   2                                                       /*!< CCU4 GIDLS: SS2I Position               */
#define CCU4_GIDLS_SS2I_Msk                   (0x01UL << CCU4_GIDLS_SS2I_Pos)                         /*!< CCU4 GIDLS: SS2I Mask                   */
#define CCU4_GIDLS_SS3I_Pos                   3                                                       /*!< CCU4 GIDLS: SS3I Position               */
#define CCU4_GIDLS_SS3I_Msk                   (0x01UL << CCU4_GIDLS_SS3I_Pos)                         /*!< CCU4 GIDLS: SS3I Mask                   */
#define CCU4_GIDLS_CPRB_Pos                   8                                                       /*!< CCU4 GIDLS: CPRB Position               */
#define CCU4_GIDLS_CPRB_Msk                   (0x01UL << CCU4_GIDLS_CPRB_Pos)                         /*!< CCU4 GIDLS: CPRB Mask                   */
#define CCU4_GIDLS_PSIC_Pos                   9                                                       /*!< CCU4 GIDLS: PSIC Position               */
#define CCU4_GIDLS_PSIC_Msk                   (0x01UL << CCU4_GIDLS_PSIC_Pos)                         /*!< CCU4 GIDLS: PSIC Mask                   */

/* ---------------------------------  CCU4_GIDLC  --------------------------------- */
#define CCU4_GIDLC_CS0I_Pos                   0                                                       /*!< CCU4 GIDLC: CS0I Position               */
#define CCU4_GIDLC_CS0I_Msk                   (0x01UL << CCU4_GIDLC_CS0I_Pos)                         /*!< CCU4 GIDLC: CS0I Mask                   */
#define CCU4_GIDLC_CS1I_Pos                   1                                                       /*!< CCU4 GIDLC: CS1I Position               */
#define CCU4_GIDLC_CS1I_Msk                   (0x01UL << CCU4_GIDLC_CS1I_Pos)                         /*!< CCU4 GIDLC: CS1I Mask                   */
#define CCU4_GIDLC_CS2I_Pos                   2                                                       /*!< CCU4 GIDLC: CS2I Position               */
#define CCU4_GIDLC_CS2I_Msk                   (0x01UL << CCU4_GIDLC_CS2I_Pos)                         /*!< CCU4 GIDLC: CS2I Mask                   */
#define CCU4_GIDLC_CS3I_Pos                   3                                                       /*!< CCU4 GIDLC: CS3I Position               */
#define CCU4_GIDLC_CS3I_Msk                   (0x01UL << CCU4_GIDLC_CS3I_Pos)                         /*!< CCU4 GIDLC: CS3I Mask                   */
#define CCU4_GIDLC_SPRB_Pos                   8                                                       /*!< CCU4 GIDLC: SPRB Position               */
#define CCU4_GIDLC_SPRB_Msk                   (0x01UL << CCU4_GIDLC_SPRB_Pos)                         /*!< CCU4 GIDLC: SPRB Mask                   */

/* ----------------------------------  CCU4_GCSS  --------------------------------- */
#define CCU4_GCSS_S0SE_Pos                    0                                                       /*!< CCU4 GCSS: S0SE Position                */
#define CCU4_GCSS_S0SE_Msk                    (0x01UL << CCU4_GCSS_S0SE_Pos)                          /*!< CCU4 GCSS: S0SE Mask                    */
#define CCU4_GCSS_S0DSE_Pos                   1                                                       /*!< CCU4 GCSS: S0DSE Position               */
#define CCU4_GCSS_S0DSE_Msk                   (0x01UL << CCU4_GCSS_S0DSE_Pos)                         /*!< CCU4 GCSS: S0DSE Mask                   */
#define CCU4_GCSS_S0PSE_Pos                   2                                                       /*!< CCU4 GCSS: S0PSE Position               */
#define CCU4_GCSS_S0PSE_Msk                   (0x01UL << CCU4_GCSS_S0PSE_Pos)                         /*!< CCU4 GCSS: S0PSE Mask                   */
#define CCU4_GCSS_S1SE_Pos                    4                                                       /*!< CCU4 GCSS: S1SE Position                */
#define CCU4_GCSS_S1SE_Msk                    (0x01UL << CCU4_GCSS_S1SE_Pos)                          /*!< CCU4 GCSS: S1SE Mask                    */
#define CCU4_GCSS_S1DSE_Pos                   5                                                       /*!< CCU4 GCSS: S1DSE Position               */
#define CCU4_GCSS_S1DSE_Msk                   (0x01UL << CCU4_GCSS_S1DSE_Pos)                         /*!< CCU4 GCSS: S1DSE Mask                   */
#define CCU4_GCSS_S1PSE_Pos                   6                                                       /*!< CCU4 GCSS: S1PSE Position               */
#define CCU4_GCSS_S1PSE_Msk                   (0x01UL << CCU4_GCSS_S1PSE_Pos)                         /*!< CCU4 GCSS: S1PSE Mask                   */
#define CCU4_GCSS_S2SE_Pos                    8                                                       /*!< CCU4 GCSS: S2SE Position                */
#define CCU4_GCSS_S2SE_Msk                    (0x01UL << CCU4_GCSS_S2SE_Pos)                          /*!< CCU4 GCSS: S2SE Mask                    */
#define CCU4_GCSS_S2DSE_Pos                   9                                                       /*!< CCU4 GCSS: S2DSE Position               */
#define CCU4_GCSS_S2DSE_Msk                   (0x01UL << CCU4_GCSS_S2DSE_Pos)                         /*!< CCU4 GCSS: S2DSE Mask                   */
#define CCU4_GCSS_S2PSE_Pos                   10                                                      /*!< CCU4 GCSS: S2PSE Position               */
#define CCU4_GCSS_S2PSE_Msk                   (0x01UL << CCU4_GCSS_S2PSE_Pos)                         /*!< CCU4 GCSS: S2PSE Mask                   */
#define CCU4_GCSS_S3SE_Pos                    12                                                      /*!< CCU4 GCSS: S3SE Position                */
#define CCU4_GCSS_S3SE_Msk                    (0x01UL << CCU4_GCSS_S3SE_Pos)                          /*!< CCU4 GCSS: S3SE Mask                    */
#define CCU4_GCSS_S3DSE_Pos                   13                                                      /*!< CCU4 GCSS: S3DSE Position               */
#define CCU4_GCSS_S3DSE_Msk                   (0x01UL << CCU4_GCSS_S3DSE_Pos)                         /*!< CCU4 GCSS: S3DSE Mask                   */
#define CCU4_GCSS_S3PSE_Pos                   14                                                      /*!< CCU4 GCSS: S3PSE Position               */
#define CCU4_GCSS_S3PSE_Msk                   (0x01UL << CCU4_GCSS_S3PSE_Pos)                         /*!< CCU4 GCSS: S3PSE Mask                   */
#define CCU4_GCSS_S0STS_Pos                   16                                                      /*!< CCU4 GCSS: S0STS Position               */
#define CCU4_GCSS_S0STS_Msk                   (0x01UL << CCU4_GCSS_S0STS_Pos)                         /*!< CCU4 GCSS: S0STS Mask                   */
#define CCU4_GCSS_S1STS_Pos                   17                                                      /*!< CCU4 GCSS: S1STS Position               */
#define CCU4_GCSS_S1STS_Msk                   (0x01UL << CCU4_GCSS_S1STS_Pos)                         /*!< CCU4 GCSS: S1STS Mask                   */
#define CCU4_GCSS_S2STS_Pos                   18                                                      /*!< CCU4 GCSS: S2STS Position               */
#define CCU4_GCSS_S2STS_Msk                   (0x01UL << CCU4_GCSS_S2STS_Pos)                         /*!< CCU4 GCSS: S2STS Mask                   */
#define CCU4_GCSS_S3STS_Pos                   19                                                      /*!< CCU4 GCSS: S3STS Position               */
#define CCU4_GCSS_S3STS_Msk                   (0x01UL << CCU4_GCSS_S3STS_Pos)                         /*!< CCU4 GCSS: S3STS Mask                   */

