FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* ---------------------------------  SHS_CALGC0  --------------------------------- */
#define SHS_CALGC0_CALGNVALS_Pos              0                                                       /*!< SHS CALGC0: CALGNVALS Position          */
#define SHS_CALGC0_CALGNVALS_Msk              (0x00003fffUL << SHS_CALGC0_CALGNVALS_Pos)              /*!< SHS CALGC0: CALGNVALS Mask              */
#define SHS_CALGC0_GNSWC_Pos                  15                                                      /*!< SHS CALGC0: GNSWC Position              */
#define SHS_CALGC0_GNSWC_Msk                  (0x01UL << SHS_CALGC0_GNSWC_Pos)                        /*!< SHS CALGC0: GNSWC Mask                  */
#define SHS_CALGC0_CALGNVALA_Pos              16                                                      /*!< SHS CALGC0: CALGNVALA Position          */
#define SHS_CALGC0_CALGNVALA_Msk              (0x00003fffUL << SHS_CALGC0_CALGNVALA_Pos)              /*!< SHS CALGC0: CALGNVALA Mask              */
#define SHS_CALGC0_GNAWC_Pos                  31                                                      /*!< SHS CALGC0: GNAWC Position              */
#define SHS_CALGC0_GNAWC_Msk                  (0x01UL << SHS_CALGC0_GNAWC_Pos)                        /*!< SHS CALGC0: GNAWC Mask                  */

/* ---------------------------------  SHS_CALGC1  --------------------------------- */
#define SHS_CALGC1_CALGNVALS_Pos              0                                                       /*!< SHS CALGC1: CALGNVALS Position          */
#define SHS_CALGC1_CALGNVALS_Msk              (0x00003fffUL << SHS_CALGC1_CALGNVALS_Pos)              /*!< SHS CALGC1: CALGNVALS Mask              */
#define SHS_CALGC1_GNSWC_Pos                  15                                                      /*!< SHS CALGC1: GNSWC Position              */
#define SHS_CALGC1_GNSWC_Msk                  (0x01UL << SHS_CALGC1_GNSWC_Pos)                        /*!< SHS CALGC1: GNSWC Mask                  */
#define SHS_CALGC1_CALGNVALA_Pos              16                                                      /*!< SHS CALGC1: CALGNVALA Position          */
#define SHS_CALGC1_CALGNVALA_Msk              (0x00003fffUL << SHS_CALGC1_CALGNVALA_Pos)              /*!< SHS CALGC1: CALGNVALA Mask              */
#define SHS_CALGC1_GNAWC_Pos                  31                                                      /*!< SHS CALGC1: GNAWC Position              */
#define SHS_CALGC1_GNAWC_Msk                  (0x01UL << SHS_CALGC1_GNAWC_Pos)                        /*!< SHS CALGC1: GNAWC Mask                  */

/* ---------------------------------  SHS_GNCTR00  -------------------------------- */
#define SHS_GNCTR00_GAIN0_Pos                 0                                                       /*!< SHS GNCTR00: GAIN0 Position             */
#define SHS_GNCTR00_GAIN0_Msk                 (0x0fUL << SHS_GNCTR00_GAIN0_Pos)                       /*!< SHS GNCTR00: GAIN0 Mask                 */
#define SHS_GNCTR00_GAIN1_Pos                 4                                                       /*!< SHS GNCTR00: GAIN1 Position             */
#define SHS_GNCTR00_GAIN1_Msk                 (0x0fUL << SHS_GNCTR00_GAIN1_Pos)                       /*!< SHS GNCTR00: GAIN1 Mask                 */
#define SHS_GNCTR00_GAIN2_Pos                 8                                                       /*!< SHS GNCTR00: GAIN2 Position             */
#define SHS_GNCTR00_GAIN2_Msk                 (0x0fUL << SHS_GNCTR00_GAIN2_Pos)                       /*!< SHS GNCTR00: GAIN2 Mask                 */
#define SHS_GNCTR00_GAIN3_Pos                 12                                                      /*!< SHS GNCTR00: GAIN3 Position             */
#define SHS_GNCTR00_GAIN3_Msk                 (0x0fUL << SHS_GNCTR00_GAIN3_Pos)                       /*!< SHS GNCTR00: GAIN3 Mask                 */
#define SHS_GNCTR00_GAIN4_Pos                 16                                                      /*!< SHS GNCTR00: GAIN4 Position             */
#define SHS_GNCTR00_GAIN4_Msk                 (0x0fUL << SHS_GNCTR00_GAIN4_Pos)                       /*!< SHS GNCTR00: GAIN4 Mask                 */
#define SHS_GNCTR00_GAIN5_Pos                 20                                                      /*!< SHS GNCTR00: GAIN5 Position             */
#define SHS_GNCTR00_GAIN5_Msk                 (0x0fUL << SHS_GNCTR00_GAIN5_Pos)                       /*!< SHS GNCTR00: GAIN5 Mask                 */
#define SHS_GNCTR00_GAIN6_Pos                 24                                                      /*!< SHS GNCTR00: GAIN6 Position             */
#define SHS_GNCTR00_GAIN6_Msk                 (0x0fUL << SHS_GNCTR00_GAIN6_Pos)                       /*!< SHS GNCTR00: GAIN6 Mask                 */
#define SHS_GNCTR00_GAIN7_Pos                 28                                                      /*!< SHS GNCTR00: GAIN7 Position             */
#define SHS_GNCTR00_GAIN7_Msk                 (0x0fUL << SHS_GNCTR00_GAIN7_Pos)                       /*!< SHS GNCTR00: GAIN7 Mask                 */

/* ---------------------------------  SHS_GNCTR10  -------------------------------- */
#define SHS_GNCTR10_GAIN0_Pos                 0                                                       /*!< SHS GNCTR10: GAIN0 Position             */
#define SHS_GNCTR10_GAIN0_Msk                 (0x0fUL << SHS_GNCTR10_GAIN0_Pos)                       /*!< SHS GNCTR10: GAIN0 Mask                 */
#define SHS_GNCTR10_GAIN1_Pos                 4                                                       /*!< SHS GNCTR10: GAIN1 Position             */
#define SHS_GNCTR10_GAIN1_Msk                 (0x0fUL << SHS_GNCTR10_GAIN1_Pos)                       /*!< SHS GNCTR10: GAIN1 Mask                 */
#define SHS_GNCTR10_GAIN2_Pos                 8                                                       /*!< SHS GNCTR10: GAIN2 Position             */
#define SHS_GNCTR10_GAIN2_Msk                 (0x0fUL << SHS_GNCTR10_GAIN2_Pos)                       /*!< SHS GNCTR10: GAIN2 Mask                 */
#define SHS_GNCTR10_GAIN3_Pos                 12                                                      /*!< SHS GNCTR10: GAIN3 Position             */
#define SHS_GNCTR10_GAIN3_Msk                 (0x0fUL << SHS_GNCTR10_GAIN3_Pos)                       /*!< SHS GNCTR10: GAIN3 Mask                 */
#define SHS_GNCTR10_GAIN4_Pos                 16                                                      /*!< SHS GNCTR10: GAIN4 Position             */
#define SHS_GNCTR10_GAIN4_Msk                 (0x0fUL << SHS_GNCTR10_GAIN4_Pos)                       /*!< SHS GNCTR10: GAIN4 Mask                 */
#define SHS_GNCTR10_GAIN5_Pos                 20                                                      /*!< SHS GNCTR10: GAIN5 Position             */
#define SHS_GNCTR10_GAIN5_Msk                 (0x0fUL << SHS_GNCTR10_GAIN5_Pos)                       /*!< SHS GNCTR10: GAIN5 Mask                 */
#define SHS_GNCTR10_GAIN6_Pos                 24                                                      /*!< SHS GNCTR10: GAIN6 Position             */
#define SHS_GNCTR10_GAIN6_Msk                 (0x0fUL << SHS_GNCTR10_GAIN6_Pos)                       /*!< SHS GNCTR10: GAIN6 Mask                 */
#define SHS_GNCTR10_GAIN7_Pos                 28                                                      /*!< SHS GNCTR10: GAIN7 Position             */
#define SHS_GNCTR10_GAIN7_Msk                 (0x0fUL << SHS_GNCTR10_GAIN7_Pos)                       /*!< SHS GNCTR10: GAIN7 Mask                 */


/* ================================================================================ */
/* ================          Group 'BCCU' Position & Mask          ================ */
/* ================================================================================ */


/* --------------------------------  BCCU_GLOBCON  -------------------------------- */
#define BCCU_GLOBCON_TM_Pos                   0                                                       /*!< BCCU GLOBCON: TM Position               */
#define BCCU_GLOBCON_TM_Msk                   (0x01UL << BCCU_GLOBCON_TM_Pos)                         /*!< BCCU GLOBCON: TM Mask                   */
#define BCCU_GLOBCON_TRDEL_Pos                2                                                       /*!< BCCU GLOBCON: TRDEL Position            */
#define BCCU_GLOBCON_TRDEL_Msk                (0x03UL << BCCU_GLOBCON_TRDEL_Pos)                      /*!< BCCU GLOBCON: TRDEL Mask                */
#define BCCU_GLOBCON_SUSCFG_Pos               4                                                       /*!< BCCU GLOBCON: SUSCFG Position           */
#define BCCU_GLOBCON_SUSCFG_Msk               (0x03UL << BCCU_GLOBCON_SUSCFG_Pos)                     /*!< BCCU GLOBCON: SUSCFG Mask               */
#define BCCU_GLOBCON_TRAPIS_Pos               6                                                       /*!< BCCU GLOBCON: TRAPIS Position           */
#define BCCU_GLOBCON_TRAPIS_Msk               (0x0fUL << BCCU_GLOBCON_TRAPIS_Pos)                     /*!< BCCU GLOBCON: TRAPIS Mask               */
#define BCCU_GLOBCON_TRAPED_Pos               10                                                      /*!< BCCU GLOBCON: TRAPED Position           */
#define BCCU_GLOBCON_TRAPED_Msk               (0x01UL << BCCU_GLOBCON_TRAPED_Pos)                     /*!< BCCU GLOBCON: TRAPED Mask               */
#define BCCU_GLOBCON_LTRS_Pos                 12                                                      /*!< BCCU GLOBCON: LTRS Position             */
#define BCCU_GLOBCON_LTRS_Msk                 (0x0fUL << BCCU_GLOBCON_LTRS_Pos)                       /*!< BCCU GLOBCON: LTRS Mask                 */
#define BCCU_GLOBCON_WDMBN_Pos                16                                                      /*!< BCCU GLOBCON: WDMBN Position            */
#define BCCU_GLOBCON_WDMBN_Msk                (0x00000fffUL << BCCU_GLOBCON_WDMBN_Pos)                /*!< BCCU GLOBCON: WDMBN Mask                */

/* --------------------------------  BCCU_GLOBCLK  -------------------------------- */
#define BCCU_GLOBCLK_FCLK_PS_Pos              0                                                       /*!< BCCU GLOBCLK: FCLK_PS Position          */
#define BCCU_GLOBCLK_FCLK_PS_Msk              (0x00000fffUL << BCCU_GLOBCLK_FCLK_PS_Pos)              /*!< BCCU GLOBCLK: FCLK_PS Mask              */
#define BCCU_GLOBCLK_BCS_Pos                  15                                                      /*!< BCCU GLOBCLK: BCS Position              */
#define BCCU_GLOBCLK_BCS_Msk                  (0x01UL << BCCU_GLOBCLK_BCS_Pos)                        /*!< BCCU GLOBCLK: BCS Mask                  */
#define BCCU_GLOBCLK_DCLK_PS_Pos              16                                                      /*!< BCCU GLOBCLK: DCLK_PS Position          */
#define BCCU_GLOBCLK_DCLK_PS_Msk              (0x00000fffUL << BCCU_GLOBCLK_DCLK_PS_Pos)              /*!< BCCU GLOBCLK: DCLK_PS Mask              */

