FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* -----------------------------------  BCCU_ID  ---------------------------------- */
#define BCCU_ID_MOD_REV_Pos                   0                                                       /*!< BCCU ID: MOD_REV Position               */
#define BCCU_ID_MOD_REV_Msk                   (0x000000ffUL << BCCU_ID_MOD_REV_Pos)                   /*!< BCCU ID: MOD_REV Mask                   */
#define BCCU_ID_MOD_TYPE0_Pos                 8                                                       /*!< BCCU ID: MOD_TYPE0 Position             */
#define BCCU_ID_MOD_TYPE0_Msk                 (0x000000ffUL << BCCU_ID_MOD_TYPE0_Pos)                 /*!< BCCU ID: MOD_TYPE0 Mask                 */
#define BCCU_ID_MOD_NUMBER_Pos                16                                                      /*!< BCCU ID: MOD_NUMBER Position            */
#define BCCU_ID_MOD_NUMBER_Msk                (0x0000ffffUL << BCCU_ID_MOD_NUMBER_Pos)                /*!< BCCU ID: MOD_NUMBER Mask                */

/* ----------------------------------  BCCU_CHEN  --------------------------------- */
#define BCCU_CHEN_ECH0_Pos                    0                                                       /*!< BCCU CHEN: ECH0 Position                */
#define BCCU_CHEN_ECH0_Msk                    (0x01UL << BCCU_CHEN_ECH0_Pos)                          /*!< BCCU CHEN: ECH0 Mask                    */
#define BCCU_CHEN_ECH1_Pos                    1                                                       /*!< BCCU CHEN: ECH1 Position                */
#define BCCU_CHEN_ECH1_Msk                    (0x01UL << BCCU_CHEN_ECH1_Pos)                          /*!< BCCU CHEN: ECH1 Mask                    */
#define BCCU_CHEN_ECH2_Pos                    2                                                       /*!< BCCU CHEN: ECH2 Position                */
#define BCCU_CHEN_ECH2_Msk                    (0x01UL << BCCU_CHEN_ECH2_Pos)                          /*!< BCCU CHEN: ECH2 Mask                    */
#define BCCU_CHEN_ECH3_Pos                    3                                                       /*!< BCCU CHEN: ECH3 Position                */
#define BCCU_CHEN_ECH3_Msk                    (0x01UL << BCCU_CHEN_ECH3_Pos)                          /*!< BCCU CHEN: ECH3 Mask                    */
#define BCCU_CHEN_ECH4_Pos                    4                                                       /*!< BCCU CHEN: ECH4 Position                */
#define BCCU_CHEN_ECH4_Msk                    (0x01UL << BCCU_CHEN_ECH4_Pos)                          /*!< BCCU CHEN: ECH4 Mask                    */
#define BCCU_CHEN_ECH5_Pos                    5                                                       /*!< BCCU CHEN: ECH5 Position                */
#define BCCU_CHEN_ECH5_Msk                    (0x01UL << BCCU_CHEN_ECH5_Pos)                          /*!< BCCU CHEN: ECH5 Mask                    */
#define BCCU_CHEN_ECH6_Pos                    6                                                       /*!< BCCU CHEN: ECH6 Position                */
#define BCCU_CHEN_ECH6_Msk                    (0x01UL << BCCU_CHEN_ECH6_Pos)                          /*!< BCCU CHEN: ECH6 Mask                    */
#define BCCU_CHEN_ECH7_Pos                    7                                                       /*!< BCCU CHEN: ECH7 Position                */
#define BCCU_CHEN_ECH7_Msk                    (0x01UL << BCCU_CHEN_ECH7_Pos)                          /*!< BCCU CHEN: ECH7 Mask                    */
#define BCCU_CHEN_ECH8_Pos                    8                                                       /*!< BCCU CHEN: ECH8 Position                */
#define BCCU_CHEN_ECH8_Msk                    (0x01UL << BCCU_CHEN_ECH8_Pos)                          /*!< BCCU CHEN: ECH8 Mask                    */

/* ---------------------------------  BCCU_CHOCON  -------------------------------- */
#define BCCU_CHOCON_CH0OP_Pos                 0                                                       /*!< BCCU CHOCON: CH0OP Position             */
#define BCCU_CHOCON_CH0OP_Msk                 (0x01UL << BCCU_CHOCON_CH0OP_Pos)                       /*!< BCCU CHOCON: CH0OP Mask                 */
#define BCCU_CHOCON_CH1OP_Pos                 1                                                       /*!< BCCU CHOCON: CH1OP Position             */
#define BCCU_CHOCON_CH1OP_Msk                 (0x01UL << BCCU_CHOCON_CH1OP_Pos)                       /*!< BCCU CHOCON: CH1OP Mask                 */
#define BCCU_CHOCON_CH2OP_Pos                 2                                                       /*!< BCCU CHOCON: CH2OP Position             */
#define BCCU_CHOCON_CH2OP_Msk                 (0x01UL << BCCU_CHOCON_CH2OP_Pos)                       /*!< BCCU CHOCON: CH2OP Mask                 */
#define BCCU_CHOCON_CH3OP_Pos                 3                                                       /*!< BCCU CHOCON: CH3OP Position             */
#define BCCU_CHOCON_CH3OP_Msk                 (0x01UL << BCCU_CHOCON_CH3OP_Pos)                       /*!< BCCU CHOCON: CH3OP Mask                 */
#define BCCU_CHOCON_CH4OP_Pos                 4                                                       /*!< BCCU CHOCON: CH4OP Position             */
#define BCCU_CHOCON_CH4OP_Msk                 (0x01UL << BCCU_CHOCON_CH4OP_Pos)                       /*!< BCCU CHOCON: CH4OP Mask                 */
#define BCCU_CHOCON_CH5OP_Pos                 5                                                       /*!< BCCU CHOCON: CH5OP Position             */
#define BCCU_CHOCON_CH5OP_Msk                 (0x01UL << BCCU_CHOCON_CH5OP_Pos)                       /*!< BCCU CHOCON: CH5OP Mask                 */
#define BCCU_CHOCON_CH6OP_Pos                 6                                                       /*!< BCCU CHOCON: CH6OP Position             */
#define BCCU_CHOCON_CH6OP_Msk                 (0x01UL << BCCU_CHOCON_CH6OP_Pos)                       /*!< BCCU CHOCON: CH6OP Mask                 */
#define BCCU_CHOCON_CH7OP_Pos                 7                                                       /*!< BCCU CHOCON: CH7OP Position             */
#define BCCU_CHOCON_CH7OP_Msk                 (0x01UL << BCCU_CHOCON_CH7OP_Pos)                       /*!< BCCU CHOCON: CH7OP Mask                 */
#define BCCU_CHOCON_CH8OP_Pos                 8                                                       /*!< BCCU CHOCON: CH8OP Position             */
#define BCCU_CHOCON_CH8OP_Msk                 (0x01UL << BCCU_CHOCON_CH8OP_Pos)                       /*!< BCCU CHOCON: CH8OP Mask                 */
#define BCCU_CHOCON_CH0TPE_Pos                16                                                      /*!< BCCU CHOCON: CH0TPE Position            */
#define BCCU_CHOCON_CH0TPE_Msk                (0x01UL << BCCU_CHOCON_CH0TPE_Pos)                      /*!< BCCU CHOCON: CH0TPE Mask                */
#define BCCU_CHOCON_CH1TPE_Pos                17                                                      /*!< BCCU CHOCON: CH1TPE Position            */
#define BCCU_CHOCON_CH1TPE_Msk                (0x01UL << BCCU_CHOCON_CH1TPE_Pos)                      /*!< BCCU CHOCON: CH1TPE Mask                */
#define BCCU_CHOCON_CH2TPE_Pos                18                                                      /*!< BCCU CHOCON: CH2TPE Position            */
#define BCCU_CHOCON_CH2TPE_Msk                (0x01UL << BCCU_CHOCON_CH2TPE_Pos)                      /*!< BCCU CHOCON: CH2TPE Mask                */
#define BCCU_CHOCON_CH3TPE_Pos                19                                                      /*!< BCCU CHOCON: CH3TPE Position            */
#define BCCU_CHOCON_CH3TPE_Msk                (0x01UL << BCCU_CHOCON_CH3TPE_Pos)                      /*!< BCCU CHOCON: CH3TPE Mask                */
#define BCCU_CHOCON_CH4TPE_Pos                20                                                      /*!< BCCU CHOCON: CH4TPE Position            */
#define BCCU_CHOCON_CH4TPE_Msk                (0x01UL << BCCU_CHOCON_CH4TPE_Pos)                      /*!< BCCU CHOCON: CH4TPE Mask                */
#define BCCU_CHOCON_CH5TPE_Pos                21                                                      /*!< BCCU CHOCON: CH5TPE Position            */
#define BCCU_CHOCON_CH5TPE_Msk                (0x01UL << BCCU_CHOCON_CH5TPE_Pos)                      /*!< BCCU CHOCON: CH5TPE Mask                */
#define BCCU_CHOCON_CH6TPE_Pos                22                                                      /*!< BCCU CHOCON: CH6TPE Position            */
#define BCCU_CHOCON_CH6TPE_Msk                (0x01UL << BCCU_CHOCON_CH6TPE_Pos)                      /*!< BCCU CHOCON: CH6TPE Mask                */
#define BCCU_CHOCON_CH7TPE_Pos                23                                                      /*!< BCCU CHOCON: CH7TPE Position            */
#define BCCU_CHOCON_CH7TPE_Msk                (0x01UL << BCCU_CHOCON_CH7TPE_Pos)                      /*!< BCCU CHOCON: CH7TPE Mask                */
#define BCCU_CHOCON_CH8TPE_Pos                24                                                      /*!< BCCU CHOCON: CH8TPE Position            */
#define BCCU_CHOCON_CH8TPE_Msk                (0x01UL << BCCU_CHOCON_CH8TPE_Pos)                      /*!< BCCU CHOCON: CH8TPE Mask                */

/* ---------------------------------  BCCU_CHTRIG  -------------------------------- */
#define BCCU_CHTRIG_ET0_Pos                   0                                                       /*!< BCCU CHTRIG: ET0 Position               */
#define BCCU_CHTRIG_ET0_Msk                   (0x01UL << BCCU_CHTRIG_ET0_Pos)                         /*!< BCCU CHTRIG: ET0 Mask                   */
#define BCCU_CHTRIG_ET1_Pos                   1                                                       /*!< BCCU CHTRIG: ET1 Position               */
#define BCCU_CHTRIG_ET1_Msk                   (0x01UL << BCCU_CHTRIG_ET1_Pos)                         /*!< BCCU CHTRIG: ET1 Mask                   */
#define BCCU_CHTRIG_ET2_Pos                   2                                                       /*!< BCCU CHTRIG: ET2 Position               */
#define BCCU_CHTRIG_ET2_Msk                   (0x01UL << BCCU_CHTRIG_ET2_Pos)                         /*!< BCCU CHTRIG: ET2 Mask                   */
#define BCCU_CHTRIG_ET3_Pos                   3                                                       /*!< BCCU CHTRIG: ET3 Position               */
#define BCCU_CHTRIG_ET3_Msk                   (0x01UL << BCCU_CHTRIG_ET3_Pos)                         /*!< BCCU CHTRIG: ET3 Mask                   */
#define BCCU_CHTRIG_ET4_Pos                   4                                                       /*!< BCCU CHTRIG: ET4 Position               */
#define BCCU_CHTRIG_ET4_Msk                   (0x01UL << BCCU_CHTRIG_ET4_Pos)                         /*!< BCCU CHTRIG: ET4 Mask                   */
#define BCCU_CHTRIG_ET5_Pos                   5                                                       /*!< BCCU CHTRIG: ET5 Position               */
#define BCCU_CHTRIG_ET5_Msk                   (0x01UL << BCCU_CHTRIG_ET5_Pos)                         /*!< BCCU CHTRIG: ET5 Mask                   */
#define BCCU_CHTRIG_ET6_Pos                   6                                                       /*!< BCCU CHTRIG: ET6 Position               */
#define BCCU_CHTRIG_ET6_Msk                   (0x01UL << BCCU_CHTRIG_ET6_Pos)                         /*!< BCCU CHTRIG: ET6 Mask                   */
#define BCCU_CHTRIG_ET7_Pos                   7                                                       /*!< BCCU CHTRIG: ET7 Position               */
#define BCCU_CHTRIG_ET7_Msk                   (0x01UL << BCCU_CHTRIG_ET7_Pos)                         /*!< BCCU CHTRIG: ET7 Mask                   */
#define BCCU_CHTRIG_ET8_Pos                   8                                                       /*!< BCCU CHTRIG: ET8 Position               */
#define BCCU_CHTRIG_ET8_Msk                   (0x01UL << BCCU_CHTRIG_ET8_Pos)                         /*!< BCCU CHTRIG: ET8 Mask                   */
#define BCCU_CHTRIG_TOS0_Pos                  16                                                      /*!< BCCU CHTRIG: TOS0 Position              */
#define BCCU_CHTRIG_TOS0_Msk                  (0x01UL << BCCU_CHTRIG_TOS0_Pos)                        /*!< BCCU CHTRIG: TOS0 Mask                  */
#define BCCU_CHTRIG_TOS1_Pos                  17                                                      /*!< BCCU CHTRIG: TOS1 Position              */
#define BCCU_CHTRIG_TOS1_Msk                  (0x01UL << BCCU_CHTRIG_TOS1_Pos)                        /*!< BCCU CHTRIG: TOS1 Mask                  */
#define BCCU_CHTRIG_TOS2_Pos                  18                                                      /*!< BCCU CHTRIG: TOS2 Position              */
#define BCCU_CHTRIG_TOS2_Msk                  (0x01UL << BCCU_CHTRIG_TOS2_Pos)                        /*!< BCCU CHTRIG: TOS2 Mask                  */
#define BCCU_CHTRIG_TOS3_Pos                  19                                                      /*!< BCCU CHTRIG: TOS3 Position              */
#define BCCU_CHTRIG_TOS3_Msk                  (0x01UL << BCCU_CHTRIG_TOS3_Pos)                        /*!< BCCU CHTRIG: TOS3 Mask                  */
#define BCCU_CHTRIG_TOS4_Pos                  20                                                      /*!< BCCU CHTRIG: TOS4 Position              */
#define BCCU_CHTRIG_TOS4_Msk                  (0x01UL << BCCU_CHTRIG_TOS4_Pos)                        /*!< BCCU CHTRIG: TOS4 Mask                  */
#define BCCU_CHTRIG_TOS5_Pos                  21                                                      /*!< BCCU CHTRIG: TOS5 Position              */
#define BCCU_CHTRIG_TOS5_Msk                  (0x01UL << BCCU_CHTRIG_TOS5_Pos)                        /*!< BCCU CHTRIG: TOS5 Mask                  */
#define BCCU_CHTRIG_TOS6_Pos                  22                                                      /*!< BCCU CHTRIG: TOS6 Position              */
#define BCCU_CHTRIG_TOS6_Msk                  (0x01UL << BCCU_CHTRIG_TOS6_Pos)                        /*!< BCCU CHTRIG: TOS6 Mask                  */
#define BCCU_CHTRIG_TOS7_Pos                  23                                                      /*!< BCCU CHTRIG: TOS7 Position              */
#define BCCU_CHTRIG_TOS7_Msk                  (0x01UL << BCCU_CHTRIG_TOS7_Pos)                        /*!< BCCU CHTRIG: TOS7 Mask                  */
#define BCCU_CHTRIG_TOS8_Pos                  24                                                      /*!< BCCU CHTRIG: TOS8 Position              */
#define BCCU_CHTRIG_TOS8_Msk                  (0x01UL << BCCU_CHTRIG_TOS8_Pos)                        /*!< BCCU CHTRIG: TOS8 Mask                  */

