FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1300.h
/* --------------------------------  BCCU_CHSTRCON  ------------------------------- */
#define BCCU_CHSTRCON_CH0S_Pos                0                                                       /*!< BCCU CHSTRCON: CH0S Position            */
#define BCCU_CHSTRCON_CH0S_Msk                (0x01UL << BCCU_CHSTRCON_CH0S_Pos)                      /*!< BCCU CHSTRCON: CH0S Mask                */
#define BCCU_CHSTRCON_CH1S_Pos                1                                                       /*!< BCCU CHSTRCON: CH1S Position            */
#define BCCU_CHSTRCON_CH1S_Msk                (0x01UL << BCCU_CHSTRCON_CH1S_Pos)                      /*!< BCCU CHSTRCON: CH1S Mask                */
#define BCCU_CHSTRCON_CH2S_Pos                2                                                       /*!< BCCU CHSTRCON: CH2S Position            */
#define BCCU_CHSTRCON_CH2S_Msk                (0x01UL << BCCU_CHSTRCON_CH2S_Pos)                      /*!< BCCU CHSTRCON: CH2S Mask                */
#define BCCU_CHSTRCON_CH3S_Pos                3                                                       /*!< BCCU CHSTRCON: CH3S Position            */
#define BCCU_CHSTRCON_CH3S_Msk                (0x01UL << BCCU_CHSTRCON_CH3S_Pos)                      /*!< BCCU CHSTRCON: CH3S Mask                */
#define BCCU_CHSTRCON_CH4S_Pos                4                                                       /*!< BCCU CHSTRCON: CH4S Position            */
#define BCCU_CHSTRCON_CH4S_Msk                (0x01UL << BCCU_CHSTRCON_CH4S_Pos)                      /*!< BCCU CHSTRCON: CH4S Mask                */
#define BCCU_CHSTRCON_CH5S_Pos                5                                                       /*!< BCCU CHSTRCON: CH5S Position            */
#define BCCU_CHSTRCON_CH5S_Msk                (0x01UL << BCCU_CHSTRCON_CH5S_Pos)                      /*!< BCCU CHSTRCON: CH5S Mask                */
#define BCCU_CHSTRCON_CH6S_Pos                6                                                       /*!< BCCU CHSTRCON: CH6S Position            */
#define BCCU_CHSTRCON_CH6S_Msk                (0x01UL << BCCU_CHSTRCON_CH6S_Pos)                      /*!< BCCU CHSTRCON: CH6S Mask                */
#define BCCU_CHSTRCON_CH7S_Pos                7                                                       /*!< BCCU CHSTRCON: CH7S Position            */
#define BCCU_CHSTRCON_CH7S_Msk                (0x01UL << BCCU_CHSTRCON_CH7S_Pos)                      /*!< BCCU CHSTRCON: CH7S Mask                */
#define BCCU_CHSTRCON_CH8S_Pos                8                                                       /*!< BCCU CHSTRCON: CH8S Position            */
#define BCCU_CHSTRCON_CH8S_Msk                (0x01UL << BCCU_CHSTRCON_CH8S_Pos)                      /*!< BCCU CHSTRCON: CH8S Mask                */
#define BCCU_CHSTRCON_CH0A_Pos                16                                                      /*!< BCCU CHSTRCON: CH0A Position            */
#define BCCU_CHSTRCON_CH0A_Msk                (0x01UL << BCCU_CHSTRCON_CH0A_Pos)                      /*!< BCCU CHSTRCON: CH0A Mask                */
#define BCCU_CHSTRCON_CH1A_Pos                17                                                      /*!< BCCU CHSTRCON: CH1A Position            */
#define BCCU_CHSTRCON_CH1A_Msk                (0x01UL << BCCU_CHSTRCON_CH1A_Pos)                      /*!< BCCU CHSTRCON: CH1A Mask                */
#define BCCU_CHSTRCON_CH2A_Pos                18                                                      /*!< BCCU CHSTRCON: CH2A Position            */
#define BCCU_CHSTRCON_CH2A_Msk                (0x01UL << BCCU_CHSTRCON_CH2A_Pos)                      /*!< BCCU CHSTRCON: CH2A Mask                */
#define BCCU_CHSTRCON_CH3A_Pos                19                                                      /*!< BCCU CHSTRCON: CH3A Position            */
#define BCCU_CHSTRCON_CH3A_Msk                (0x01UL << BCCU_CHSTRCON_CH3A_Pos)                      /*!< BCCU CHSTRCON: CH3A Mask                */
#define BCCU_CHSTRCON_CH4A_Pos                20                                                      /*!< BCCU CHSTRCON: CH4A Position            */
#define BCCU_CHSTRCON_CH4A_Msk                (0x01UL << BCCU_CHSTRCON_CH4A_Pos)                      /*!< BCCU CHSTRCON: CH4A Mask                */
#define BCCU_CHSTRCON_CH5A_Pos                21                                                      /*!< BCCU CHSTRCON: CH5A Position            */
#define BCCU_CHSTRCON_CH5A_Msk                (0x01UL << BCCU_CHSTRCON_CH5A_Pos)                      /*!< BCCU CHSTRCON: CH5A Mask                */
#define BCCU_CHSTRCON_CH6A_Pos                22                                                      /*!< BCCU CHSTRCON: CH6A Position            */
#define BCCU_CHSTRCON_CH6A_Msk                (0x01UL << BCCU_CHSTRCON_CH6A_Pos)                      /*!< BCCU CHSTRCON: CH6A Mask                */
#define BCCU_CHSTRCON_CH7A_Pos                23                                                      /*!< BCCU CHSTRCON: CH7A Position            */
#define BCCU_CHSTRCON_CH7A_Msk                (0x01UL << BCCU_CHSTRCON_CH7A_Pos)                      /*!< BCCU CHSTRCON: CH7A Mask                */
#define BCCU_CHSTRCON_CH8A_Pos                24                                                      /*!< BCCU CHSTRCON: CH8A Position            */
#define BCCU_CHSTRCON_CH8A_Msk                (0x01UL << BCCU_CHSTRCON_CH8A_Pos)                      /*!< BCCU CHSTRCON: CH8A Mask                */

/* ---------------------------------  BCCU_LTCHOL  -------------------------------- */
#define BCCU_LTCHOL_LTOL0_Pos                 0                                                       /*!< BCCU LTCHOL: LTOL0 Position             */
#define BCCU_LTCHOL_LTOL0_Msk                 (0x01UL << BCCU_LTCHOL_LTOL0_Pos)                       /*!< BCCU LTCHOL: LTOL0 Mask                 */
#define BCCU_LTCHOL_LTOL1_Pos                 1                                                       /*!< BCCU LTCHOL: LTOL1 Position             */
#define BCCU_LTCHOL_LTOL1_Msk                 (0x01UL << BCCU_LTCHOL_LTOL1_Pos)                       /*!< BCCU LTCHOL: LTOL1 Mask                 */
#define BCCU_LTCHOL_LTOL2_Pos                 2                                                       /*!< BCCU LTCHOL: LTOL2 Position             */
#define BCCU_LTCHOL_LTOL2_Msk                 (0x01UL << BCCU_LTCHOL_LTOL2_Pos)                       /*!< BCCU LTCHOL: LTOL2 Mask                 */
#define BCCU_LTCHOL_LTOL3_Pos                 3                                                       /*!< BCCU LTCHOL: LTOL3 Position             */
#define BCCU_LTCHOL_LTOL3_Msk                 (0x01UL << BCCU_LTCHOL_LTOL3_Pos)                       /*!< BCCU LTCHOL: LTOL3 Mask                 */
#define BCCU_LTCHOL_LTOL4_Pos                 4                                                       /*!< BCCU LTCHOL: LTOL4 Position             */
#define BCCU_LTCHOL_LTOL4_Msk                 (0x01UL << BCCU_LTCHOL_LTOL4_Pos)                       /*!< BCCU LTCHOL: LTOL4 Mask                 */
#define BCCU_LTCHOL_LTOL5_Pos                 5                                                       /*!< BCCU LTCHOL: LTOL5 Position             */
#define BCCU_LTCHOL_LTOL5_Msk                 (0x01UL << BCCU_LTCHOL_LTOL5_Pos)                       /*!< BCCU LTCHOL: LTOL5 Mask                 */
#define BCCU_LTCHOL_LTOL6_Pos                 6                                                       /*!< BCCU LTCHOL: LTOL6 Position             */
#define BCCU_LTCHOL_LTOL6_Msk                 (0x01UL << BCCU_LTCHOL_LTOL6_Pos)                       /*!< BCCU LTCHOL: LTOL6 Mask                 */
#define BCCU_LTCHOL_LTOL7_Pos                 7                                                       /*!< BCCU LTCHOL: LTOL7 Position             */
#define BCCU_LTCHOL_LTOL7_Msk                 (0x01UL << BCCU_LTCHOL_LTOL7_Pos)                       /*!< BCCU LTCHOL: LTOL7 Mask                 */
#define BCCU_LTCHOL_LTOL8_Pos                 8                                                       /*!< BCCU LTCHOL: LTOL8 Position             */
#define BCCU_LTCHOL_LTOL8_Msk                 (0x01UL << BCCU_LTCHOL_LTOL8_Pos)                       /*!< BCCU LTCHOL: LTOL8 Mask                 */

/* ----------------------------------  BCCU_DEEN  --------------------------------- */
#define BCCU_DEEN_EDE0_Pos                    0                                                       /*!< BCCU DEEN: EDE0 Position                */
#define BCCU_DEEN_EDE0_Msk                    (0x01UL << BCCU_DEEN_EDE0_Pos)                          /*!< BCCU DEEN: EDE0 Mask                    */
#define BCCU_DEEN_EDE1_Pos                    1                                                       /*!< BCCU DEEN: EDE1 Position                */
#define BCCU_DEEN_EDE1_Msk                    (0x01UL << BCCU_DEEN_EDE1_Pos)                          /*!< BCCU DEEN: EDE1 Mask                    */
#define BCCU_DEEN_EDE2_Pos                    2                                                       /*!< BCCU DEEN: EDE2 Position                */
#define BCCU_DEEN_EDE2_Msk                    (0x01UL << BCCU_DEEN_EDE2_Pos)                          /*!< BCCU DEEN: EDE2 Mask                    */

/* --------------------------------  BCCU_DESTRCON  ------------------------------- */
#define BCCU_DESTRCON_DE0S_Pos                0                                                       /*!< BCCU DESTRCON: DE0S Position            */
#define BCCU_DESTRCON_DE0S_Msk                (0x01UL << BCCU_DESTRCON_DE0S_Pos)                      /*!< BCCU DESTRCON: DE0S Mask                */
#define BCCU_DESTRCON_DE1S_Pos                1                                                       /*!< BCCU DESTRCON: DE1S Position            */
#define BCCU_DESTRCON_DE1S_Msk                (0x01UL << BCCU_DESTRCON_DE1S_Pos)                      /*!< BCCU DESTRCON: DE1S Mask                */
#define BCCU_DESTRCON_DE2S_Pos                2                                                       /*!< BCCU DESTRCON: DE2S Position            */
#define BCCU_DESTRCON_DE2S_Msk                (0x01UL << BCCU_DESTRCON_DE2S_Pos)                      /*!< BCCU DESTRCON: DE2S Mask                */
#define BCCU_DESTRCON_DE0A_Pos                16                                                      /*!< BCCU DESTRCON: DE0A Position            */
#define BCCU_DESTRCON_DE0A_Msk                (0x01UL << BCCU_DESTRCON_DE0A_Pos)                      /*!< BCCU DESTRCON: DE0A Mask                */
#define BCCU_DESTRCON_DE1A_Pos                17                                                      /*!< BCCU DESTRCON: DE1A Position            */
#define BCCU_DESTRCON_DE1A_Msk                (0x01UL << BCCU_DESTRCON_DE1A_Pos)                      /*!< BCCU DESTRCON: DE1A Mask                */
#define BCCU_DESTRCON_DE2A_Pos                18                                                      /*!< BCCU DESTRCON: DE2A Position            */
#define BCCU_DESTRCON_DE2A_Msk                (0x01UL << BCCU_DESTRCON_DE2A_Pos)                      /*!< BCCU DESTRCON: DE2A Mask                */

/* --------------------------------  BCCU_GLOBDIM  -------------------------------- */
#define BCCU_GLOBDIM_GLOBDIM_Pos              0                                                       /*!< BCCU GLOBDIM: GLOBDIM Position          */
#define BCCU_GLOBDIM_GLOBDIM_Msk              (0x00000fffUL << BCCU_GLOBDIM_GLOBDIM_Pos)              /*!< BCCU GLOBDIM: GLOBDIM Mask              */

/* ---------------------------------  BCCU_EVIER  --------------------------------- */
#define BCCU_EVIER_T0IEN_Pos                  0                                                       /*!< BCCU EVIER: T0IEN Position              */
#define BCCU_EVIER_T0IEN_Msk                  (0x01UL << BCCU_EVIER_T0IEN_Pos)                        /*!< BCCU EVIER: T0IEN Mask                  */
#define BCCU_EVIER_T1IEN_Pos                  1                                                       /*!< BCCU EVIER: T1IEN Position              */
#define BCCU_EVIER_T1IEN_Msk                  (0x01UL << BCCU_EVIER_T1IEN_Pos)                        /*!< BCCU EVIER: T1IEN Mask                  */
#define BCCU_EVIER_FIEN_Pos                   2                                                       /*!< BCCU EVIER: FIEN Position               */
#define BCCU_EVIER_FIEN_Msk                   (0x01UL << BCCU_EVIER_FIEN_Pos)                         /*!< BCCU EVIER: FIEN Mask                   */
#define BCCU_EVIER_EIEN_Pos                   3                                                       /*!< BCCU EVIER: EIEN Position               */
#define BCCU_EVIER_EIEN_Msk                   (0x01UL << BCCU_EVIER_EIEN_Pos)                         /*!< BCCU EVIER: EIEN Mask                   */
#define BCCU_EVIER_TPIEN_Pos                  4                                                       /*!< BCCU EVIER: TPIEN Position              */
#define BCCU_EVIER_TPIEN_Msk                  (0x01UL << BCCU_EVIER_TPIEN_Pos)                        /*!< BCCU EVIER: TPIEN Mask                  */

/* ----------------------------------  BCCU_EVFR  --------------------------------- */
#define BCCU_EVFR_T0F_Pos                     0                                                       /*!< BCCU EVFR: T0F Position                 */
#define BCCU_EVFR_T0F_Msk                     (0x01UL << BCCU_EVFR_T0F_Pos)                           /*!< BCCU EVFR: T0F Mask                     */
#define BCCU_EVFR_T1F_Pos                     1                                                       /*!< BCCU EVFR: T1F Position                 */
#define BCCU_EVFR_T1F_Msk                     (0x01UL << BCCU_EVFR_T1F_Pos)                           /*!< BCCU EVFR: T1F Mask                     */
#define BCCU_EVFR_FF_Pos                      2                                                       /*!< BCCU EVFR: FF Position                  */
#define BCCU_EVFR_FF_Msk                      (0x01UL << BCCU_EVFR_FF_Pos)                            /*!< BCCU EVFR: FF Mask                      */
#define BCCU_EVFR_EF_Pos                      3                                                       /*!< BCCU EVFR: EF Position                  */
#define BCCU_EVFR_EF_Msk                      (0x01UL << BCCU_EVFR_EF_Pos)                            /*!< BCCU EVFR: EF Mask                      */
#define BCCU_EVFR_TPF_Pos                     4                                                       /*!< BCCU EVFR: TPF Position                 */
#define BCCU_EVFR_TPF_Msk                     (0x01UL << BCCU_EVFR_TPF_Pos)                           /*!< BCCU EVFR: TPF Mask                     */
#define BCCU_EVFR_TPSF_Pos                    6                                                       /*!< BCCU EVFR: TPSF Position                */
#define BCCU_EVFR_TPSF_Msk                    (0x01UL << BCCU_EVFR_TPSF_Pos)                          /*!< BCCU EVFR: TPSF Mask                    */
#define BCCU_EVFR_TPINL_Pos                   7                                                       /*!< BCCU EVFR: TPINL Position               */
#define BCCU_EVFR_TPINL_Msk                   (0x01UL << BCCU_EVFR_TPINL_Pos)                         /*!< BCCU EVFR: TPINL Mask                   */

/* ---------------------------------  BCCU_EVFSR  --------------------------------- */
#define BCCU_EVFSR_T0FS_Pos                   0                                                       /*!< BCCU EVFSR: T0FS Position               */
#define BCCU_EVFSR_T0FS_Msk                   (0x01UL << BCCU_EVFSR_T0FS_Pos)                         /*!< BCCU EVFSR: T0FS Mask                   */
#define BCCU_EVFSR_T1FS_Pos                   1                                                       /*!< BCCU EVFSR: T1FS Position               */
#define BCCU_EVFSR_T1FS_Msk                   (0x01UL << BCCU_EVFSR_T1FS_Pos)                         /*!< BCCU EVFSR: T1FS Mask                   */
#define BCCU_EVFSR_FFS_Pos                    2                                                       /*!< BCCU EVFSR: FFS Position                */
#define BCCU_EVFSR_FFS_Msk                    (0x01UL << BCCU_EVFSR_FFS_Pos)                          /*!< BCCU EVFSR: FFS Mask                    */
#define BCCU_EVFSR_EFS_Pos                    3                                                       /*!< BCCU EVFSR: EFS Position                */
#define BCCU_EVFSR_EFS_Msk                    (0x01UL << BCCU_EVFSR_EFS_Pos)                          /*!< BCCU EVFSR: EFS Mask                    */
#define BCCU_EVFSR_TPFS_Pos                   4                                                       /*!< BCCU EVFSR: TPFS Position               */
#define BCCU_EVFSR_TPFS_Msk                   (0x01UL << BCCU_EVFSR_TPFS_Pos)                         /*!< BCCU EVFSR: TPFS Mask                   */
#define BCCU_EVFSR_TPS_Pos                    6                                                       /*!< BCCU EVFSR: TPS Position                */
#define BCCU_EVFSR_TPS_Msk                    (0x01UL << BCCU_EVFSR_TPS_Pos)                          /*!< BCCU EVFSR: TPS Mask                    */

/* ---------------------------------  BCCU_EVFCR  --------------------------------- */
#define BCCU_EVFCR_T0FC_Pos                   0                                                       /*!< BCCU EVFCR: T0FC Position               */
#define BCCU_EVFCR_T0FC_Msk                   (0x01UL << BCCU_EVFCR_T0FC_Pos)                         /*!< BCCU EVFCR: T0FC Mask                   */
#define BCCU_EVFCR_T1FC_Pos                   1                                                       /*!< BCCU EVFCR: T1FC Position               */
#define BCCU_EVFCR_T1FC_Msk                   (0x01UL << BCCU_EVFCR_T1FC_Pos)                         /*!< BCCU EVFCR: T1FC Mask                   */
#define BCCU_EVFCR_FFC_Pos                    2                                                       /*!< BCCU EVFCR: FFC Position                */
#define BCCU_EVFCR_FFC_Msk                    (0x01UL << BCCU_EVFCR_FFC_Pos)                          /*!< BCCU EVFCR: FFC Mask                    */
#define BCCU_EVFCR_EFC_Pos                    3                                                       /*!< BCCU EVFCR: EFC Position                */
#define BCCU_EVFCR_EFC_Msk                    (0x01UL << BCCU_EVFCR_EFC_Pos)                          /*!< BCCU EVFCR: EFC Mask                    */
#define BCCU_EVFCR_TPFC_Pos                   4                                                       /*!< BCCU EVFCR: TPFC Position               */
#define BCCU_EVFCR_TPFC_Msk                   (0x01UL << BCCU_EVFCR_TPFC_Pos)                         /*!< BCCU EVFCR: TPFC Mask                   */
#define BCCU_EVFCR_TPC_Pos                    6                                                       /*!< BCCU EVFCR: TPC Position                */
#define BCCU_EVFCR_TPC_Msk                    (0x01UL << BCCU_EVFCR_TPC_Pos)                          /*!< BCCU EVFCR: TPC Mask                    */


/* ================================================================================ */
/* ================         Group 'BCCU_CH' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  BCCU_CH_INTS  -------------------------------- */
#define BCCU_CH_INTS_TCHINT_Pos               0                                                       /*!< BCCU_CH INTS: TCHINT Position           */
#define BCCU_CH_INTS_TCHINT_Msk               (0x00000fffUL << BCCU_CH_INTS_TCHINT_Pos)               /*!< BCCU_CH INTS: TCHINT Mask               */

/* ---------------------------------  BCCU_CH_INT  -------------------------------- */
#define BCCU_CH_INT_CHINT_Pos                 0                                                       /*!< BCCU_CH INT: CHINT Position             */
#define BCCU_CH_INT_CHINT_Msk                 (0x00000fffUL << BCCU_CH_INT_CHINT_Pos)                 /*!< BCCU_CH INT: CHINT Mask                 */

/* ------------------------------  BCCU_CH_CHCONFIG  ------------------------------ */
#define BCCU_CH_CHCONFIG_PKTH_Pos             0                                                       /*!< BCCU_CH CHCONFIG: PKTH Position         */
#define BCCU_CH_CHCONFIG_PKTH_Msk             (0x07UL << BCCU_CH_CHCONFIG_PKTH_Pos)                   /*!< BCCU_CH CHCONFIG: PKTH Mask             */
#define BCCU_CH_CHCONFIG_PEN_Pos              3                                                       /*!< BCCU_CH CHCONFIG: PEN Position          */
#define BCCU_CH_CHCONFIG_PEN_Msk              (0x01UL << BCCU_CH_CHCONFIG_PEN_Pos)                    /*!< BCCU_CH CHCONFIG: PEN Mask              */
#define BCCU_CH_CHCONFIG_DSEL_Pos             4                                                       /*!< BCCU_CH CHCONFIG: DSEL Position         */
#define BCCU_CH_CHCONFIG_DSEL_Msk             (0x07UL << BCCU_CH_CHCONFIG_DSEL_Pos)                   /*!< BCCU_CH CHCONFIG: DSEL Mask             */
#define BCCU_CH_CHCONFIG_DBP_Pos              7                                                       /*!< BCCU_CH CHCONFIG: DBP Position          */
#define BCCU_CH_CHCONFIG_DBP_Msk              (0x01UL << BCCU_CH_CHCONFIG_DBP_Pos)                    /*!< BCCU_CH CHCONFIG: DBP Mask              */
#define BCCU_CH_CHCONFIG_GEN_Pos              8                                                       /*!< BCCU_CH CHCONFIG: GEN Position          */
#define BCCU_CH_CHCONFIG_GEN_Msk              (0x01UL << BCCU_CH_CHCONFIG_GEN_Pos)                    /*!< BCCU_CH CHCONFIG: GEN Mask              */
#define BCCU_CH_CHCONFIG_WEN_Pos              9                                                       /*!< BCCU_CH CHCONFIG: WEN Position          */
#define BCCU_CH_CHCONFIG_WEN_Msk              (0x01UL << BCCU_CH_CHCONFIG_WEN_Pos)                    /*!< BCCU_CH CHCONFIG: WEN Mask              */
#define BCCU_CH_CHCONFIG_TRED_Pos             10                                                      /*!< BCCU_CH CHCONFIG: TRED Position         */
#define BCCU_CH_CHCONFIG_TRED_Msk             (0x01UL << BCCU_CH_CHCONFIG_TRED_Pos)                   /*!< BCCU_CH CHCONFIG: TRED Mask             */
#define BCCU_CH_CHCONFIG_ENFT_Pos             11                                                      /*!< BCCU_CH CHCONFIG: ENFT Position         */
#define BCCU_CH_CHCONFIG_ENFT_Msk             (0x01UL << BCCU_CH_CHCONFIG_ENFT_Pos)                   /*!< BCCU_CH CHCONFIG: ENFT Mask             */
#define BCCU_CH_CHCONFIG_LINPRES_Pos          16                                                      /*!< BCCU_CH CHCONFIG: LINPRES Position      */
#define BCCU_CH_CHCONFIG_LINPRES_Msk          (0x000003ffUL << BCCU_CH_CHCONFIG_LINPRES_Pos)          /*!< BCCU_CH CHCONFIG: LINPRES Mask          */

/* --------------------------------  BCCU_CH_PKCMP  ------------------------------- */
#define BCCU_CH_PKCMP_OFFCMP_Pos              0                                                       /*!< BCCU_CH PKCMP: OFFCMP Position          */
#define BCCU_CH_PKCMP_OFFCMP_Msk              (0x000000ffUL << BCCU_CH_PKCMP_OFFCMP_Pos)              /*!< BCCU_CH PKCMP: OFFCMP Mask              */
#define BCCU_CH_PKCMP_ONCMP_Pos               16                                                      /*!< BCCU_CH PKCMP: ONCMP Position           */
#define BCCU_CH_PKCMP_ONCMP_Msk               (0x000000ffUL << BCCU_CH_PKCMP_ONCMP_Pos)               /*!< BCCU_CH PKCMP: ONCMP Mask               */

